
{
    "version": "https://jsonfeed.org/version/1",
    "title": "",
    
    "home_page_url": "https://www.connorjrobbins.com/",
    "feed_url": "https://www.connorjrobbins.com/feed.json",
    "expired": false,
    "items": [

        {
            "id": "/blog/principle-of-charity",
            "title": "Principle of Charity",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Trying to have a civil disagreement, discussion, or debate online is a noble but misguided idea.</p>\n\n<p>Social media rarely rewards or amplifies civilized discussion instead promoting the most vitriolic and polarizing messages to the tops of our feeds. These posts then serve as examples to every new user entering the fray, and that serves to perpetuate this already awful situation. (Is it any wonder that when we incentivize poor behavior, poor behavior is what we get?)</p>\n\n<p>A familiar example of this for many people is the <strong>willful misinterpretation</strong> of their point.</p>\n\n<p>If you have ever tried to have an earnest discussion online chances are you have had a horribly twisted interpretation of your words thrown back at you before you had a chance to lean back in your chair after hitting “send.” No matter how clear you felt you made your statement, or how kindly-worded your post was, as soon as someone disagrees, all bets are off—there are no rules of engagement.</p>\n\n<p>Even more impressive is when they don’t disagree with your point at all, and instead find some way to re-interpret your words into something they <em>could</em> disagree with.</p>\n\n<p>As Sam Biddle—a writer very familiar with the unforgiving nature of interpretation on the internet—says:</p>\n\n<blockquote>\n  <p>“Twitter is a fast machine that almost begs for misunderstanding and misconstrual—deliberate misreading is its lubricant.”</p>\n\n  <p>- <a href=\"https://www.gawker.com/justine-sacco-is-good-at-her-job-and-how-i-came-to-pea-1653022326\">Sam Biddle</a></p>\n</blockquote>\n\n<p>This is clearly terrible, but what is the solution?</p>\n\n<p>Without platform intervention to incentivize good behavior, there is no solution. This is an issue that cannot be solved at the individual level as all it takes is one bad actor to throw a discussion off the rails.</p>\n\n<p>But, that doesn’t mean we should give up. We can still do our best, and find those hidden corners of the internet where positive discussion still exists. But even there it can be easy to fall into bad habits.</p>\n\n<p>But where does it all begin?</p>\n\n<p>Many people point to various cognitive biases and logical fallacies as the root of it all. While I agree that education in these areas benefits critical thinking, I believe there is something more foundational.</p>\n\n<p>We must begin with the interpretation of words.</p>\n\n<p>When I studied logic, we didn’t begin with fallacies or biases. We began with the interpretation of statements into propositions.</p>\n\n<p>We began with basic interpretation.</p>\n\n<p>And there was something incredible about this. Often, even the simplest sentence in English could be translated into several different logical propositions. As the sentences became more and more complex, the flexibility of interpretation grew as well.</p>\n\n<p>Through this exercise, it became obvious that clarity of communication is important, but never sufficient. Even if we are making an effort to interpret things correctly, we can get it wrong. (Not to mention if we are attempting to willfully misinterpret what is being said.)</p>\n\n<p>So if speaking our point clearly isn’t enough, what else is needed?</p>\n\n<p>Charitable interpretation.</p>\n\n<p><em>And here is where online discussions tend to fall apart.</em></p>\n\n<p>If the exact same sentence can be interpreted in many different ways, how do we pick the right interpretation?</p>\n\n<p>We have a few options:</p>\n\n<ol>\n  <li>Pick the interpretation that is easiest for us to argue against.</li>\n  <li>Pick the interpretation we think is most likely what the speaker meant.</li>\n  <li>Pick the interpretation that is the most difficult to argue against.</li>\n</ol>\n\n<p>Online you’ll find that option 1 is most often chosen.</p>\n\n<p>Most often this amounts to straw-manning, but I think a funnier example is viral “bad takes.” If you’ve been around Twitter long enough you’ll know that most of these “bad takes” are really just a joke, sarcasm, or outright bait. But it’s much easier to react believing someone is an idiot than to give them the benefit of the doubt.</p>\n\n<p>Option 2 might seem to be the most appealing, it shows a sense of argumentative empathy, and in some ways feels like it’s the most honest to the person you’d be interacting with. But, it still depends on us making an accurate judgment. Any decision we make will be based on assumptions around the person you’re interacting with, and depending on these assumptions you can choose whatever interpretation you want. At its best, it’s option 3 and at its worst, it’s option 1 in disguise.</p>\n\n<p>This makes option 2 the most dangerous of the three. It gives us all the confidence we need to believe we are acting in good faith while allowing us the leeway to do just the opposite.</p>\n\n<p><strong>Be aware of falling into this trap.</strong> Many people believe they are gifted at interpreting the points of others accurately. Very few are. And regardless of your ability to understand someone deeply, this sort of interpretation isn’t as good as other, simpler, more consistent options.</p>\n\n<p>Namely, there is option 3 which, in essence, is the principle of charity.</p>\n\n<p>Want to make one small change that will lead to a happier life and a smarter you? Start engaging with others using the principle of charity.</p>\n\n<p>When a statement can be interpreted in many ways, pick the one that is the strongest statement of their argument, even if it may not be what they meant.</p>\n\n<p>This has a few benefits:</p>\n\n<ol>\n  <li>Suddenly we see everyone as the smartest version of themselves leading to less cynicism.</li>\n  <li>It quickly elevates debates to stronger, more complex points, improving our understanding of the topic.</li>\n</ol>\n\n<p>Again, there is nothing we can do about those that don’t want to act in good faith, but we can do our best to educate others about it, and surround ourselves with those who act charitably.</p>\n\n<p>When social media desires the worst from you, be strong enough to show it your best.</p>\n\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/principle-of-charity",
            "summary": "When social media desires the worst from you, be strong enough to show it your best.",
            "date_published": "2021-09-26 00:00:00 +0000"
            
        },

        {
            "id": "/blog/sharpen-your-axe",
            "title": "Sharpen Your Axe",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<blockquote>\n  <p>Give me six hours to chop down a tree and I will spend the first four sharpening the axe.</p>\n\n  <p>-Abraham Lincoln</p>\n</blockquote>\n\n<p>A very popular quote, but, in my experience? Rarely acted upon.</p>\n\n<p>Most people don’t bother to sharpen the axe, opting instead to start chopping away immediately.</p>\n\n<p>And who can blame them?</p>\n\n<p>In our lives, moments feel precious and deadlines approach fast. It’s difficult to make decisions that may have long-term benefits when an alternative path shows progress immediately. When we’re faced with the decision of sharpening the axe or starting to chop, why spend even a second on something that doesn’t move the needle forward immediately?</p>\n\n<p><strong>Improving your use of time is the same as creating additional time.</strong> *</p>\n\n<p>*(In the long run.)</p>\n\n<hr>\n\n<p>Before we dig into it, note that the most effective way to make more time in your life is by reducing the time spent doing things that provide you no value. They aren’t relaxing, enjoyable, educational, profitable, etc. A shocking amount of time is spent on things that don’t need to be done, that we don’t want to do when it comes down to it.</p>\n\n<p><em>Chopping down a tree with a sharpened axe may be quick, but realizing that the tree doesn’t need to be cut down at all is even faster.</em></p>\n\n<p>So let’s carry on with the assumption that the tree does need to be removed. (That we’re talking about valuable tasks and the tools you use for them.)</p>\n\n<hr>\n\n<p>If you’re an office worker, chances are you can point out a few pieces of software you use regularly. A few tasks that you do on a weekly, or even daily, basis.</p>\n\n<p>So let’s ask ourselves:</p>\n\n<ul>\n  <li>What are the tools that you use most in your life?</li>\n  <li>Are you maintaining them?</li>\n  <li>Have you investigated alternatives recently?</li>\n  <li>Are you more effective at using them now than you were a year ago?</li>\n</ul>\n\n<!-- This post is a specific example of something I've written about in the past: in your system or on your system. -->\n\n<p>In a typical office environment, a key tool might be Outlook or Excel. For salespeople, it might be their CRM, or more abstractly, their persuasion. Regardless of what you do, consider the tools that you use most frequently. Have you been sharpening them? Or have you been using them the same way for the last five years?</p>\n\n<hr>\n\n<p>When I started my first job my manager was, without a doubt, the most proficient Excel user in the entire office. The speed with which he could work was unparalleled, and even those in finance, who likely used Excel more than him, were always shocked by his ability.</p>\n\n<p>But it’s not as if he was a genius, or had some special ability to understand the program, he just put in a little time learning more efficient techniques. With him as my manager, I quickly learned them too.</p>\n\n<p>In a few months, I was able to more effectively use the software than some professionals that had been using it for more than a decade.</p>\n\n<p>This wasn’t because I was smarter, it wasn’t because I learned it in school, it wasn’t because I was born in a generation that grew up with computers. It was because I took the 10 minutes to investigate shortcuts, and allowed them to become muscle memory over a couple months.</p>\n\n<p>It’s one way to drastically improve workflow that doesn’t require hard work. It only requires a decision on how you spend your time.</p>\n\n<hr>\n\n<p>Take account of the tools you use most frequently.</p>\n\n<ul>\n  <li>Is there a better alternative? (No point sharpening your axe when there are chainsaws available.)</li>\n  <li>What are the actions that slow you down? What are the actions you take most frequently? How can you improve these two areas?</li>\n</ul>\n\n<p>One final thought: There was a point when I was spending 6 hours a day using Excel. If it cost 4 hours of research to become even 3% more efficient, that time investment would pay for itself after about a month.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/sharpen-your-axe",
            "summary": "Improving your use of time is the same as creating additional time.",
            "date_published": "2021-09-11 00:00:00 +0000"
            
        },

        {
            "id": "/blog/getting-out-of-a-rut",
            "title": "Getting out of a Rut",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>It happens to the best of us, probably more over this last year than any time in recent history.</p>\n\n<p>Getting stuck in a rut is not fun.</p>\n\n<p>We become disillusioned with our day-to-day. Stuck in a monotony that seems to pull us down, surrounding us with apathy. Sometimes it’s worse than this. We feel hopeless, helpless. We feel like nothing will change, that nothing we do can change things.</p>\n\n<p>And if we feel this way, how can we find meaning? How can we put in effort towards fulfilling work when it feels like our tank is empty all of the time?</p>\n\n<hr>\n\n<p>A while back I was caught in a rut.</p>\n\n<p>My thoughts spiraled endlessly and apathetically. Eventually, I managed to grab onto a sliver of inspiration, just enough to write a quick checklist that helped me get out of that rut.</p>\n\n<p>Since then I’ve refined this list further and shared it with friends. I can’t guarantee it’ll work for everyone, but hopefully, it helps someone.</p>\n\n<hr>\n\n<p>Before we get to the list, a quick disclaimer:</p>\n\n<p>This post is not about major depression. If you are dealing with clinical depression, seek professional help or other resources made for your situation.</p>\n\n<!-- Major depression is associated with a deficit in executive functioning. -->\n\n<!-- As the methods below require a great deal of up-front executive function, it's unlikely to be useful for someone experiencing major depression. -->\n\n<p>Now, onto the checklist.</p>\n\n<hr>\n\n<h2 id=\"i-define-your-guiding-lights-in-your-personal-and-professional-lives\">I. Define your guiding lights in your personal and professional lives<a href=\"#i-define-your-guiding-lights-in-your-personal-and-professional-lives\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Spend some time imagining what your ideal future looks like, no matter how far-fetched. What does your perfect day look like? What’s your perfect career?</p>\n\n<p>Start working backward from there. If that’s what you want your life to be in 5 years, where does it need to be in 1 year? Where do you need to be in 6 months?</p>\n\n<p>With this in mind, what are the next immediate goals?</p>\n\n<p>As an example, your personal goal might be finding a significant other and your professional goal might be getting a promotion at work.</p>\n\n<h2 id=\"ii-take-account-of-your-self-talk\">II. Take account of your self-talk<a href=\"#ii-take-account-of-your-self-talk\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Take some time and reflect on the negative thoughts that are polluting your brain. In my experience when you’re in the midst of a rut it’s easy to allow some negative thoughts to loop endlessly in your mind. Only to find upon reflection that they are irrational.</p>\n\n<p>Perhaps you’ve been telling yourself that you’re bad at your job, or that the people in power at the office are out to get you. That there is no way out from the situation you’ve found yourself in.</p>\n\n<p>Upon reflection pathways forward are clear. First check for rationality. Is there <em>real</em> evidence that you are bad at your job? Is there any evidence that counters that belief?</p>\n\n<p>Even in cases where there is some truth to the negative thoughts, define what aspects are within your control, and what next steps you might take.</p>\n\n<p>For example, perhaps you aren’t a good fit for your current job. It makes sense then that you should focus your effort on finding a new role.</p>\n\n<p>This exercise should help you notice when these thoughts come up again in the coming days, and help you to shut them down when they do. It may also provide some additional goals to focus on.</p>\n\n<h2 id=\"iii-take-account-of-your-time\">III. Take account of your time<a href=\"#iii-take-account-of-your-time\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>What ways of spending your time make you happy? Angry? Upset? Sad?</p>\n\n<p>There are some people in my life that I can call knowing I’ll feel better after the conversation than when it started. There are some apps where I know I’ll feel worse having scrolled through them than when I first clicked their icon.</p>\n\n<p>Think about the way you’ve spent your time in the past. Which activities/people/places have brought you relief. Perhaps it’s a hobby that you’ve neglected. Perhaps it’s a friend you haven’t spoken to in some time.</p>\n\n<p>Whatever it is, add it to the list.</p>\n\n<h2 id=\"iv-make-the-plan\">IV. Make the plan<a href=\"#iv-make-the-plan\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>After all the above steps are completed, you should have a nice list of goals/actions. Probably a list with <em>too many</em> goals/actions.</p>\n\n<p>Now is the time to prioritize.</p>\n\n<p>What you’re looking for is actions that take the least effort, but still move the needle forward.</p>\n\n<p>Getting out of a rut isn’t about making a big change, it’s about building momentum. When your speed is 0, even the smallest acceleration is huge.</p>\n\n<h2 id=\"v-take-the-first-step-today\">V. Take the first step. Today.<a href=\"#v-take-the-first-step-today\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Once you’ve put in all this effort, the worst thing you can do is quit before you’ve built up any momentum. Take this inspiration and use it to make even the smallest step.</p>\n\n<p>A few ways I like to do this:</p>\n\n<p><strong>Phone a friend.</strong> If there is a friend you know who always manages to improve your mood, call them. It’s a great first step.</p>\n\n<p><strong>Start a new habit.</strong> Find a simple daily habit related to one of your goals, and start it today.</p>\n\n<p><strong>Quit a detrimental habit.</strong> Have an app that makes you feel worse? Perhaps a snack that always leaves you feeling sluggish? Delete the app, or throw away the snack. Today is the first day of breaking that habit.</p>\n\n<p><strong>Take a forcing action.</strong> Even if you don’t have the energy to move the needle forward today, you can take what I call a “forcing action” to make sure you will tomorrow. If my goal is getting a promotion, a forcing action may be scheduling a meeting with my manager. The action of scheduling a meeting takes nearly no effort, but it forces me to then spend time over the next week preparing for that meeting.</p>\n\n<h2 id=\"vi-parting-words\">VI. Parting words<a href=\"#vi-parting-words\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>The essence of this method is simple.</p>\n\n<ol>\n  <li>Take the time to understand what you want from life.</li>\n  <li>Take the smallest possible action that builds momentum towards that life.</li>\n</ol>\n\n<p>Good luck.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/getting-out-of-a-rut",
            "summary": "The method I use to get back on course.",
            "date_published": "2021-09-04 00:00:00 +0000"
            
        },

        {
            "id": "/blog/stillness",
            "title": "Stillness",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>My mind was empty. And my first reaction was fear.</p>\n\n<hr>\n\n<p>Recently, I was on vacation in a cottage by a lake. Journal in hand I walked to the dock, sat in a Muskoka chair, opened my journal to write down my thoughts, and found something peculiar was on my mind. Nothing.</p>\n\n<p><em>I had nothing on my mind.</em></p>\n\n<p>The well had run dry, and my first reaction was fear. But my second reaction was happiness. I felt a certain stillness sitting by that lake with the blank pages of my notebook that I hadn’t felt in a long time.</p>\n\n<p>Sure, no ideas were vying for my attention, but equally so, there were no worries, no stress. I felt for the first time in a long time some sense of peace. Truly at ease with the world.</p>\n\n<p>The well being dry wasn’t an indication that my creativity had left me. It indicated that both my creativity and fears were no longer compulsions. Instead, I could draw upon them as needed. I could be intentional with what was on my mind.</p>\n\n<p>Later on, I managed to have a productive session with my notebook, but only after thoroughly enjoying my stillness by the lake.</p>\n\n<hr>\n\n<p>After reflecting on this, I believe there are three main reasons for this stillness. Actions that anyone can take that I believe can reduce stress.</p>\n\n<h2 id=\"i-frequent-journaling\">I. Frequent Journaling<a href=\"#i-frequent-journaling\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>For over a year now, I have been journaling consistently—often multiple times per day. These journal entries range from passing thoughts to long-form reflection on experiences, memories, or concepts.</p>\n\n<p>Whenever I feel emotional discomfort, I journal to get to the root of the issue. And being diligent about addressing my thoughts as they happen meant I had nothing stewing in my mind while I sat by the lakeside.</p>\n\n<h2 id=\"ii-idea-management\">II. Idea Management<a href=\"#ii-idea-management\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>As I’ve become more serious about sharing my ideas, I’ve become more organized in storing them. As ideas come to me, they’re neatly tucked away for use later.</p>\n\n<p>Keeping everything organized in this way, and most importantly, storing it outside of my brain, means that no loose ideas were rattling around my mind, fearful that they’d be forgotten. I could feel the security that all of my previous thoughts worth taking down had been. Only new thoughts needed to be addressed.</p>\n\n<h2 id=\"iii-task-management\">III. Task Management<a href=\"#iii-task-management\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Last, but perhaps most important, I’ve started being more diligent about task management. Currently, I’m using a simplified version of GTD.</p>\n\n<p>The most important tenet of that system, and similar to the idea management point above, is taking these tasks that are polluting your mind, and entering them into an external system.</p>\n\n<p>If you are diligent with this, then you no longer need to worry that you are forgetting something important. Everything that you need to get done that you know about is stored elsewhere. No longer are these worries top of mind.</p>\n\n<hr>\n\n<p>The key principle is this: Our minds are good at thinking. Everything else should be stored elsewhere.</p>\n\n<p>Tasks, ideas, notes, thoughts. Organize these things in a system you can trust and you’ll no longer worry about keeping them all bouncing around in your brain. When you want to sit down to think, you’ll be able to pull them up, intentionally.</p>\n\n<p>And then, when you want to sit down by the lake and enjoy the sound of the waves hitting the dock, you won’t need to wonder if there is an email you forgot to reply to.</p>\n\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/stillness",
            "summary": "My mind was empty. And my first reaction was fear.",
            "date_published": "2021-08-28 00:00:00 +0000"
            
        },

        {
            "id": "/blog/what-we-surround-ourselves-with",
            "title": "What We Surround Ourselves With",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<blockquote>\n  <p>When we surround ourselves with falsehoods, they begin to look like the truth.<br>\n- <a href=\"https://twitter.com/i/web/status/1422927812760018950\">@connorjrobbins</a></p>\n</blockquote>\n\n<p>I was having a good day—and then I picked up my phone.</p>\n\n<p>After only five minutes of scrolling, my day had taken a negative turn.</p>\n\n<p>I had been bombarded by awful news articles, read some hot takes that made me question the sanity of the average person, and listened to a doom-ridden rant about the hopelessness of it all.</p>\n\n<p>Eventually, I was able to pull my attention away from this endless horror show, but the damage was done.</p>\n\n<p>These bits of information leaped from the screen of my phone and lodged themselves like splinters into my brain—unwelcome, piercing thoughts. Thoughts that would only become dislodged with patience, attention, tweezers, and a magnifying glass.</p>\n\n<p><em>Thoughts that shouldn’t have been there in the first place.</em></p>\n\n<p>I’m sure this will sound familiar to many of you. At this point, most people will have experienced the negative influence of social media.</p>\n\n<p>But to make matters worse, I knew better.</p>\n\n<p>Social media has burned me in the past, and I have learned from my mistakes. Over time I’ve curated my feeds, learning to be very deliberate with my follows and very liberal with my un-follows, choosing to disable algorithmic feeds where possible, opting for simple chronological content.</p>\n\n<p>In short, I’ve made sure that when I scroll, I come away feeling better and maybe even having learned something.</p>\n\n<p>But then, how was it possible I had such a negative experience?</p>\n\n<p><em>I ditched my curated feed.</em></p>\n\n<p>Every social media app has an alternative to your curated feed. Sometimes it’s called “Front Page” other times it’s called “What’s Trending.” But it’s always a <em>bad idea.</em></p>\n\n<p>I felt I had a good reason for checking out this Front Page, I wanted to see what was going on in the world. I figured, what’s a better way to put my finger on the pulse than to see what’s trending?</p>\n\n<p>But what’s trending isn’t what’s going on in the world. The Front Page doesn’t represent a random sampling of reality, it represents what people are most engaged with. And people are easily <a href=\"https://www.connorjrobbins.com/blog/dont-be-fooled-by-negativity\">fooled by negativity</a>. (Note: This is without even mentioning how easily these listings can be manipulated.)</p>\n\n<p>Those few truly awful news articles don’t accurately represent the world, they are the articles that most accurately reflect the beliefs of the majority of users on the site. Those hot takes don’t represent the average person, they represent whatever is most controversial, misunderstood, or new. The doom-ridden rant about the hopelessness of it all isn’t necessarily accurate, and by listening to it you’re forcing your brain to reflect those ideas onto itself.</p>\n\n<p>It’s easy to fool ourselves into thinking that this Front Page represents the pulse of the world. It does not. But if we believe it does, and we read it with this belief in mind, there is a real danger:</p>\n\n<p><em>If you’re not careful, the ideas you consume can feel like conclusions you’ve come to yourself.</em></p>\n\n<p>And if you don’t examine them carefully enough you may find they worm their way into your understanding of the world without your permission. Suddenly your perception will be tinted by lenses you never meant to use.</p>\n\n<hr>\n\n<p>I’ve now promised myself to stop checking the Front Page. If something noteworthy is happening, I’m sure I’ll hear about it. If I want more information on a particular topic, I’ll seek it out.</p>\n\n<p>Perhaps you’ll join me in stepping away from the Front Page, and focusing on ideas that better ourselves. I’m sure it’ll do us both a lot of good.</p>\n\n<p>Social media is like a garden, you decided to tend to it for a reason, but if you lose focus it can quickly be overwhelmed with weeds. Make sure the flowers you’ve planted are still to your taste and don’t be afraid to uproot them if they no longer are. Be vigilant, and weed as needed. Next time your scrolling, listen to your gut and curate as necessary.</p>\n\n<p>Finally, make sure that you put out into the world what you would like to receive.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/what-we-surround-ourselves-with",
            "summary": "When we surround ourselves with falsehoods, they begin to look like the truth.",
            "date_published": "2021-08-21 00:00:00 +0000"
            
        },

        {
            "id": "/blog/the-heros-journey",
            "title": "The Hero’s Journey",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>When does your story begin?</p>\n\n<hr>\n\n<p>Most of us are in a steady-state. We have our routines, we feel secure. We have an understanding of the world around us and our place within it. And, for many, that is enough.</p>\n\n<p>But others feel a desire for something different, something new.</p>\n\n<p><em>They want their life to change.</em></p>\n\n<p>But what changes one’s life?</p>\n\n<hr>\n\n<p>According to the narrative structure known as <em>The Hero’s Journey,</em> the answer to this question lies in “the call to adventure,” the opening plot point which sees our hero’s normal life disturbed by a call to head into the unknown.</p>\n\n<p>This is how the story begins. This is how the hero’s life becomes irrevocably changed. The beginning of it all lies entirely out of our hero’s hands—they are <em>called</em> into the unknown. An <em>external</em> force jolts them from normalcy.</p>\n\n<p>But, the truth is, this isn’t how real life usually works. <em>Rarely do we ever get that call.</em><sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup></p>\n\n<p>Like the hero, we exist in a situation of normalcy. Unlike the hero, we’re destined to live that way for our entire lives—<strong><em>unless we call upon ourselves.</em></strong></p>\n\n<hr>\n\n<p>But why is it that we struggle to call upon ourselves?</p>\n\n<p>We have a desire, the path may even be known to us, yet we never take that first step.</p>\n\n<p>Why?</p>\n\n<p>The Hero’s Journey has an answer for this as well. Right after the call is another plot point, this one referred to as “refusal of the call.”</p>\n\n<p>Before the call, the hero is living a comfortable life, and this adventure into the unknown represents not only a great change but often great discomfort. If you’ve ever watched a movie you know that heroes rarely ever make it to the end unscathed. Usually, they’ll have changed for the better, but not without great stress, pain, and tragedy.</p>\n\n<p>And like these stories, this remains true for real life. Most callings in life require some discomfort. The most extraordinary lives are not without pain.</p>\n\n<hr>\n\n<p>But, unlike the hero, we are not called upon, and so we wait in our comfort for our hand to be forced. We are taught that a bird in the hand is worth two in the bush, and so we settle for our lives of normalcy eschewing the possible adventure that lies before us.</p>\n\n<p><em>Choosing to walk a bed of coals is made harder from the comfort of a bed of silk.</em></p>\n\n<p>We must accept that it’s unlikely our hand will ever be forced. And so we must call upon ourselves. And only when our desire outweighs our fear can we take that first step.</p>\n\n<hr>\n\n<p>Our life is nothing more than the stories we tell ourselves.</p>\n\n<p>In stories, the hero is often forced into discomfort—forced into a situation that will change their life forever. In reality, this is rare. More often than not it’s up to us to make the tough decision and be the creator of our own story—to spur ourselves into discomfort, trusting that we’ll make it to the other side.</p>\n\n<p>Maybe then the question to ask is not “When does your story begin?” but instead <strong><em>when will you begin your story?</em></strong></p>\n\n<p>I’ll leave you with one final thought—a nice story to tell ourselves:</p>\n\n<blockquote>\n  <p>Things that were hard to bear are sweet to remember.</p>\n\n  <p>- Seneca</p>\n</blockquote>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>There certainly are many life-altering events that are outside of our control, but usually, these are not calls to adventure. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">↩</a></p>\n    </li>\n  </ol>\n</div>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/the-heros-journey",
            "summary": "Why heroes never come from comfort, and what we must all do to become heroes of our own personal story.",
            "date_published": "2021-08-14 00:00:00 +0000"
            
        },

        {
            "id": "/blog/perennial-regret",
            "title": "Perennial Regret",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>As time passes, our scope of experience increases.</p>\n\n<p>As our scope of experience increases, our personality is altered.</p>\n\n<p>As our personality is altered, the actions we take change.</p>\n\n<p>With enough time—with enough <em>growth</em>—we find ourselves looking back at our past with a sense of confusion: “Just what was I thinking?”</p>\n\n<p>We seem foolish. And yet, in that past moment, we may have made the best decision for ourselves. Knowing only what we knew then, we chose a path forward. Knowing what we know now, we see the error in our ways.</p>\n\n<p>This gap—the distance between then and now—is where regret is born.</p>\n\n<hr>\n\n<p>Perhaps our personality can be boiled down to our values and principles. Then, our actions can then be thought of as the consequence of our values—the realization of them, ideally.</p>\n\n<p>Growth sees our values change, and so our actions should follow suit.</p>\n\n<p>Then, even one that lives their entire life with intention would still be destined to face regret.</p>\n\n<p>Why? <em>In each moment, we are renewed.</em></p>\n\n<p>With our ever-increasing scope of experience, with knowing what we now know, our past is re-contextualized. We are forced to examine the mistakes of a novice with the mind of a journeyman.</p>\n\n<p>What’s more, assuming you continue to grow, <strong>this state of regret is permanent.</strong></p>\n\n<p>We are human. Even the best of us will experience embarrassment, missed opportunities, accidental hurt, and general unnecessary misfortune.</p>\n\n<p>No one can expect to live a perfect life. Worse yet, what may have felt perfect in the moment may sometimes be understood as a failure only with more years of experience.</p>\n\n<p>We can make the right decision today, and still, tomorrow we may see them as wrong with our renewed understanding.</p>\n\n<hr>\n\n<p>Do you have any regrets?</p>\n\n<p>Perhaps it’s foolish to say you have no regrets, as it implies that either you have not grown enough to note your past transgressions or that you believe them to be positive.</p>\n\n<p>That you haven’t noticed all the times you’ve embarrassed yourself, all the opportunities you’ve missed, or all the times you’ve hurt someone. Or worse, that you still believe them to be right.</p>\n\n<p>But perhaps the question shouldn’t be “Do you have any regrets?” but instead, “How do your regrets impact you?”</p>\n\n<p>Sir Anthony Hopkins spoke about this in an interview. <sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup></p>\n\n<blockquote>\n  <p>[I] Don’t have time to regret. We move on. ‘Cause we are acceptable for what we are, not what we think we should be. I am accepted in myself for what I am, not what I think I should be—because that’s a lie. I am a sinner, I am an old sinner. I’ve done some bad things—I’ve done some good things. So, you know, you just forgive yourself and move on.</p>\n</blockquote>\n\n<p>This response shows an understanding of mistake—an awareness of sin—while being able to “move on.”</p>\n\n<p>And this is the issue at hand. We have two options in life:</p>\n\n<ol>\n  <li>Avoid regret by never growing.</li>\n  <li>Learn to live with regret.</li>\n</ol>\n\n<p>Don’t avoid your personal evolution fearing it may change you.</p>\n\n<p>Don’t allow regret to consume your spirit.</p>\n\n<p>Don’t deny regret entirely, pretending you have none.</p>\n\n<p>But how do we live with it?</p>\n\n<hr>\n\n<p>As Sir Anthony Hopkins said, “Forgive yourself and move on.”</p>\n\n<p>One addition would be to make amends where necessary.</p>\n\n<p>But, for all the rest, for all the regrets that only impacted your life, forgive yourself. Take account of all your embarrassments, all those missed opportunities, all your failures. Accept them and move on.</p>\n\n<p>Keep a gentle hope that in the future, knowing what you now know, you might be able to avoid those same transgressions. Accept that perhaps your knowledge today is predicated on those previous mistakes—your experience, generally.</p>\n\n<hr>\n\n<p>All we can do is continue forward. Unresolved regret weighs us down. Don’t turn a blind eye to it. Face it head-on now, so you may move forward tomorrow.</p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p><a href=\"https://www.youtube.com/watch?v=ovypV3kmFG0&amp;t=1659s\">Sir Anthony Hopkins Sits Down with Larry - Originally Aired: 5/25/16</a> <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">↩</a></p>\n    </li>\n  </ol>\n</div>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/perennial-regret",
            "summary": "If we are growing, regret is destined to be present for all seasons of our lives. But does it need to be this way?",
            "date_published": "2021-08-07 00:00:00 +0000"
            
        },

        {
            "id": "/blog/why-I-write",
            "title": "Why I Write",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Why bother?</p>\n\n<p>At this point, I can confidently say I write more than the average person. In any given week, I spend a significant portion of time collecting thoughts, writing them out, editing them to the bone, and publishing them.</p>\n\n<p>This is time I could be spending on anything—time that I will never get back.</p>\n\n<p><em>Why do it?</em></p>\n\n<h2 id=\"i-clarity-of-thinking\">I. Clarity of thinking<a href=\"#i-clarity-of-thinking\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>How vivid are your ideas?</p>\n\n<p>Are they vivid, or is their purity fooling you into believing they’re more composed than they really are?</p>\n\n<p>It’s easy to fool yourself when you haven’t written something down—to believe you know something when you don’t.</p>\n\n<p>When our ideas are left in our minds, whether they’re theories of life, plans for the future, or reflections on an argument we had a year ago, they tend to appear perfect. Before we communicate an idea, whether through composition on the page or speaking to a friend, it’s as if our mind is holding only the platonic ideal of the idea.</p>\n\n<p>The idea represents itself as a perfect sphere, an abstract ideal that only when described in physical reality—when brought to life—will show its imperfections.</p>\n\n<p>To clarify, <em>those imperfections were always there.</em> But only through the communication of the abstract idea into reality will you be able to observe them.</p>\n\n<p>And only once you’ve observed the imperfections can you begin to improve upon them.</p>\n\n<h2 id=\"ii-my-past-self\">II. My past self<a href=\"#ii-my-past-self\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Often I write as if I were speaking to, or put more accurately, pleading with my past self.</p>\n\n<p>While I’m happy with my life, I’ve made my fair share of mistakes in life, and writing helps to address and learn from these mistakes.</p>\n\n<p>Reflection through writing can help put the past to rest and help one grow from their regrets. Not to mention, if what I write can help even one kindred spirit avoid my mistakes, it’ll all have been worth it.</p>\n\n<p>Putting my thoughts to page enforces advice that I would be willing to give to others—and reminds me to take it myself.</p>\n\n<h2 id=\"iii-in-short\">III. In short<a href=\"#iii-in-short\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>I believe that to live an intentional life, you must be self-reflective.</p>\n\n<p>And I find writing to be the deepest form of reflection possible.</p>\n\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/why-i-write",
            "summary": "I believe that to live an intentional life, you must be self-reflective.\n\nAnd I find writing to be the deepest form of reflection possible.",
            "date_published": "2021-07-31 00:00:00 +0000"
            
        },

        {
            "id": "/blog/keep-a-journal",
            "title": "Keep a Journal",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<h2 id=\"i\">I.<a href=\"#i\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>We are all artists, and our lives are our masterpieces.</p>\n\n<p>Every day we wake and return to the sculpture we’ve been working on since our birth. Chisel and mallet in hand we delicately chip away at the stone in front of us, developing our piece with whatever time we have left.</p>\n\n<p>Returning to where we left off, we focus on the angle of the chisel against the stone, the power we use when striking with the mallet. We note how the stone reacts to each cut and adjust our methods accordingly. We feel how smooth and refined the work under our chisel tip has become, and we are proud.</p>\n\n<p>But what exactly are we creating?</p>\n\n<h2 id=\"ii\">II.<a href=\"#ii\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Every day we go into this world of responsibilities, overwhelming information, and limited time. Our attention is vied for at every turn—so much so it’s now considered a commodity.</p>\n\n<p>We wake with a to-do list that only ever seems to grow. Priorities that are contradictory and insufficient. We do our best with partial knowledge of the Truth, and we carry ourselves forward—whatever direction forward may be.</p>\n\n<p>To survive this deluge of distraction, we may cope by focusing only on what’s directly in front of us. We look precisely, and only, at where our foot will fall next—at where our chisel is placed. And perhaps this provides comfort or safety.</p>\n\n<p>But where have we been? Where are we going? Why are we here?</p>\n\n<h2 id=\"iii\">III.<a href=\"#iii\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Every day we work on our sculpture, but many of us only look at the stone just beneath our chisel. We focus on our hands, the sensation of each strike of the mallet. We see the crisp, smooth lines being carved into our work.</p>\n\n<p>But maybe we should pause for a moment. Maybe we should lean back in our chair and examine the stone outside of our narrow focus—beyond the region we are currently working.</p>\n\n<p>Maybe we should even get up from our chairs and wander around the piece. Remember what we worked on ten years ago. See how it differs from the area we worked on yesterday.</p>\n\n<p>Check that the entire piece is in proportion. That even if the composition has changed through the work, it’s still holistic.</p>\n\n<p>Perhaps some areas are far under-worked. Perhaps some areas are already polished to perfection that upon reflection don’t seem to fit, and may need re-work after all.</p>\n\n<p><em>But we will never notice these things if we remain hyper-focused on the chisel and mallet.</em></p>\n\n<h2 id=\"iv\">IV.<a href=\"#iv\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>This is why I journal.</p>\n\n<p>Journaling takes me out of the moment briefly. It allows me to stop working on the sculpture, and check how the work is coming along.</p>\n\n<p>While being present in every moment is a noble goal, without reflection we may quickly find ourselves working against the piece.</p>\n\n<p>Creating a regular practice of journaling has had a few benefits for me:</p>\n\n<ol>\n  <li>Improving intention\n    <ul>\n      <li>Regular reflection gives me the time to remember where I’m heading, and change course if new information has been brought to light.</li>\n      <li>It allows me to make clear decisions for the future, and think through things in more precise ways.</li>\n    </ul>\n  </li>\n  <li>Early detection of declining mental health\n    <ul>\n      <li>Journaling makes me more cognizant of my internal monologue.</li>\n      <li>By putting it on the page it becomes obvious when negative thought patterns are emerging, and flags the need to make a change.</li>\n      <li>Whether it’s negative thought spirals, catastrophizing, or insecurity, a journal makes it clear that certain topics might require some attention and resolution.</li>\n    </ul>\n  </li>\n  <li>Getting back on track after setbacks\n    <ul>\n      <li>Similar to the point above, journaling can also be used to address, reflect on, and find closure around certain topics that are gnawing away at you.</li>\n    </ul>\n  </li>\n  <li>Discovering biases and false perceptions\n    <ul>\n      <li>Journaling allows me to evaluate new ideas and makes it clear whether they come with strong foundations, or if they’ve come to me through communicative osmosis.</li>\n      <li>It allows me to work through new thought patterns and intentionally keep or leave them.</li>\n      <li>When you surround yourself with falsehood it can appear as reality. Journaling allows you to break through this.</li>\n    </ul>\n  </li>\n  <li>Memory\n    <ul>\n      <li>Being able to look back on events, ideas, and sources of inspiration.</li>\n      <li>It also reminds me just how fickle memory is, how my perception of an event changes.</li>\n      <li>Seeing how an idea has evolved over time informs a deeper truth about yourself.</li>\n    </ul>\n  </li>\n</ol>\n\n<hr>\n\n<p>One final note: If you’re going to make a habit of journaling, do it in a method that requires external communication. Record an audio note, write on paper, type at your computer. Don’t just think, communicate, even if only to yourself.</p>\n\n<p>It might shock you how an idea that felt so clear in your mind was a deception. Only through communication will you notice the gaps.</p>\n\n<!-- TODO: Link to future post \"Why I Write\" (how communicating ideas clarifies your thinking) -->\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/keep-a-journal",
            "summary": "We are all artists, our lives our masterpieces. But what exactly are we creating?",
            "date_published": "2021-07-24 00:00:00 +0000"
            
        },

        {
            "id": "/blog/one-thing-at-a-time",
            "title": "One Thing at a Time",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Stop trying to change your life.</p>\n\n<p>New Year resolutions, detailed morning routines, buying a dozen books—stop.</p>\n\n<p>In my experience, the reason most people fail to change is that they believe it’s not enough to be better—if they’re going to try to change their life, they need to target “perfect.”</p>\n\n<p>How many times have you failed to “change your life?”</p>\n\n<h2 id=\"i-how-the-story-goes\">I. How the story goes<a href=\"#i-how-the-story-goes\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Everyone goes through highs and lows—I know I have. There are times when you feel like a failure, that nothing is going your way. Maybe it’s burnout, maybe it’s a series of unlucky occurrences, sometimes it’s as simple as it being winter. Regardless, you get stuck in a rut.</p>\n\n<p>Eventually, your executive function kicks in again, and you experience a sudden burst of energy and strategic thinking. You finally find the motivation to pull yourself out of the rut.</p>\n\n<p>You take out your notebook and start jotting down how you picture your “perfect day.” What time you’ll start waking up, what the morning routine looks like, all of those habits <em>you know</em> you should be doing but just haven’t integrated yet, the projects you want to start, and on and on. All of the planning you wish you had done years ago pours forth, and you’re happy with the picture you’ve painted on the page.</p>\n\n<p>I won’t knock this practice. Coming up with a perfect day can help us create the map with which to develop ourselves.</p>\n\n<p>The problem is that we then try to do it <strong>all at once.</strong></p>\n\n<p>I’ve done it, my friends have done it—I imagine it’s very common. In essence, you take this perfect day, this list of habits, this morning routine, and you tell yourself “Starting tomorrow, this will be the way I live.”</p>\n\n<p>Amazingly, this initial bought of motivation carries you forward for the first week, maybe two. During that time you’ll be hitting all your targets. Habits are being formed, your new sleep schedule is working out, your morning routine is making you feel incredible.</p>\n\n<p>But inevitably <em>something happens.</em></p>\n\n<p>You lose steam or something outside of your control sends you spinning.</p>\n\n<p>Before you know it you’re right back to where you were and that journal entry is hidden away in a drawer somewhere. Maybe in six months or a year, you’ll start the process all over again.</p>\n\n<h2 id=\"ii-how-to-change-the-story\">II. How to change the story<a href=\"#ii-how-to-change-the-story\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Next time, after you draw up your perfect day, pick just one thing to focus on. Only one habit that you want to form, and do it.</p>\n\n<p>Maybe it’s journaling every night before bed, or instituting the perfect shutdown ritual. Whatever it is, focus on it, singularly, until you’ve mastered it.</p>\n\n<p>And once you’ve changed your life in that one minuscule way—<strong>do it again.</strong></p>\n\n<hr>\n\n<p>This concept is related to two key ideas:</p>\n\n<ol>\n  <li>We all drastically overestimate what we can do in a day and underestimate what we can do in a year.</li>\n  <li>What we achieve over our lifetime is nothing more than the sum of all our days.</li>\n</ol>\n\n<p>I’m going to hone in on that second point for a moment because while it may be completely obvious to some, for me it took years to grasp.</p>\n\n<p><em>What we achieve over our lifetime is nothing more than the sum of all our days.</em></p>\n\n<p>We all have fantasies about our futures. Whether it’s walking the red carpet or raising a family. I’m sure you have daydreams whether in the shower or at your desk of that future. Probably often.</p>\n\n<p>And chances are it’s a future that others before you have achieved.</p>\n\n<p><strong>It’s a fantasy that is based on another’s reality.</strong></p>\n\n<p>What does that tell us?</p>\n\n<p>It tells us that it <em>can be done.</em> It’s possible. That there is some version of you that makes all the moves necessary to get there.</p>\n\n<p>But what are those moves?</p>\n\n<p>Work backward, work from large to small. Where do you need to be in five years? One year? Six months? What is the big move you need to make? What are the smaller moves you need to make to be prepared for that opportunity?</p>\n\n<p>What do you need to do today to make sure you <a href=\"https://www.connorjrobbins.com/blog/have-a-portfolio\">have a portfolio</a> when the timing is right and the opportunity is before you?</p>\n\n<p>And at the very bottom of it all: <em>What do your days look like? What are the habits you need to support this dream?</em></p>\n\n<p><strong>Pick the most important one, and start.</strong></p>\n\n<h2 id=\"iii-how-to-make-a-habit-stick\">III. How to make a habit stick<a href=\"#iii-how-to-make-a-habit-stick\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Slow growth works. Slow growth leads to permanent betterment. If you want to change who you are it’s easier to do it piece by piece than all at once. Sculpting one’s self takes time, don’t rush it.</p>\n\n<p>Through this process, you’ll also receive the added benefit of personal integrity. Which I cannot stress enough.</p>\n\n<p>But, even picking one thing and doing it is tough. Here are a few pieces of advice to help you:</p>\n\n<ol>\n  <li>Begin with identity/internal motivation.\n    <ul>\n      <li>It’s a lot easier to make a daily writing habit when you consider yourself a writer.</li>\n      <li>It’s a lot easier to get to bed on time when you understand the health risks associated with sleep deprivation.</li>\n    </ul>\n  </li>\n  <li>Focus on what’s in your control.\n    <ul>\n      <li>When setting goals, whether habits or otherwise, <a href=\"https://www.connorjrobbins.com/blog/focus-on-the-work\">focus on the work</a>\n</li>\n      <li>E.g. Don’t target getting at least 10 Instagram likes every day, target posting something high quality every day.</li>\n    </ul>\n  </li>\n  <li>Don’t lie to yourself.\n    <ul>\n      <li>You may need to fail to start a habit a few times before you can do this.</li>\n      <li>Try to have a sense of what you can truly commit yourself to. You should feel 100% certain that you can achieve your goal before you say “Yes.”</li>\n    </ul>\n  </li>\n  <li>Start small\n    <ul>\n      <li>It’s easier to go bigger after success than to go smaller after failure.</li>\n      <li>E.g. Target 5 pullups a day. Once you’ve been able to do that consistently up the amount.</li>\n    </ul>\n  </li>\n  <li>Track it.\n    <ul>\n      <li>Whether it’s marking Xs on a calendar or using a habit tracker app, record the days you succeed and fail.</li>\n      <li>Make a goal from a streak length, for example, 100 days in a row.</li>\n    </ul>\n  </li>\n  <li>Find an accountability buddy.\n    <ul>\n      <li>Creating a habit with a friend is much easier than going it alone.</li>\n      <li>Every day message each other about whether they’ve completed their habit.</li>\n    </ul>\n  </li>\n  <li>Plan for hiccups\n    <ul>\n      <li>What if during your 100-day streak you take a vacation? Or get sick? What are the rules for keeping the streak running (or putting it on pause guilt-free)?</li>\n    </ul>\n  </li>\n  <li>Plan for failure\n    <ul>\n      <li>Write out a plan of action for when you miss a day.</li>\n      <li>Having a plan allows you to get back on track without having to think about it.</li>\n    </ul>\n  </li>\n</ol>\n\n<h2 id=\"iv-parting-words\">IV. Parting words<a href=\"#iv-parting-words\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Trying to develop 30 habits at once will likely leave you unchanged. Trying to develop one habit at a time will leave you a completely different person in a year.</p>\n\n<p>If you want to be a new version of yourself, don’t target tomorrow, target the end of the year.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/one-thing-at-a-time",
            "summary": "Stop trying to change your life.",
            "date_published": "2021-07-17 00:00:00 +0000"
            
        },

        {
            "id": "/blog/chess-discovery",
            "title": "Chess Discovery",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>In chess, there is the concept of a discovered check—which I believe is a great metaphor for personal development.</p>\n\n<p>If you are unfamiliar with the expression, you might expect it has something to do with a stroke of genius or some insight on the board that leads to a brilliant move. But it is much simpler than that.</p>\n\n<p>In chess, a discovered check is an attack on the king made possible by moving one piece out of the way of another.</p>\n\n<p>For example, imagine there is a knight between your queen and your opponent’s king. Moving the knight elsewhere gives the queen a clear line of sight to the king, revealing a check.</p>\n\n<p>So what does this have to do with personal development?</p>\n\n<h2 id=\"i-applying-this-to-ourselves\">I. Applying this to ourselves<a href=\"#i-applying-this-to-ourselves\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p><em>Sometimes you need to get out of your own way to unleash your potential.</em></p>\n\n<p>Imagine that the pieces you control on a chessboard represent aspects of yourself. The opponent’s pieces represent obstacles that you’ll face day-to-day. Your pieces might be beliefs you hold, habits you’ve formed, relationships you have, etc.</p>\n\n<p>So then what does it mean to move your knight out of the way of your queen?</p>\n\n<p>At first blush, you might take this metaphor to mean one should move negative aspects of ourselves out of the way of our positive aspects.</p>\n\n<p>For example, one might imagine the knight as negative beliefs about yourself, toxic relationships, negative habits like the content you consume.</p>\n\n<p>Everyone has self-limiting aspects about themselves, and the most reflective people tend to understand them and are working to change them. With some focus and introspection, it’s clear to see what aspects of yourself are holding you back. <em>Then, you only need to get rid of them.</em></p>\n\n<p>But I think with a little more reflection on this metaphor we can reach a more nuanced conclusion.</p>\n\n<h2 id=\"ii-the-less-obvious-aspects\">II. The less obvious aspects<a href=\"#ii-the-less-obvious-aspects\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>What I love about this analogy is that the knight has value.</p>\n\n<p>Unlike a bad habit or self-limiting belief, it’s not something you want to be removed from the board. But, it can sometimes hold you back from the best move nonetheless. It’s useful, but it can get in the way.</p>\n\n<p><em>And often these things which are positive, but limiting, are the most difficult to see</em></p>\n\n<p>Think about what <em>positive</em> aspects of yourself or actions that you take might nonetheless be getting in your way on occasion. Is your strict method of productivity putting a damper on your creativity? Is your adherence to time-boxing causing you to put down a task just as you got in the flow—just as you were on the edge of a breakthrough?</p>\n\n<p>These positive aspects don’t need to be habits, they can also be aspects of our personality. Consider, are you the type of person that says “yes” to everything? Are you overly amiable? Both of these may be seen as positive traits, especially by those that hold them, but really reflect for a moment: Are they holding you back?</p>\n\n<p>Take a moment to reflect on the traits and habits you believe are valuable. Then take a moment to see if there are any situations where those traits and habits might be limiting.</p>\n\n<p><em>Seek out the edge cases of your personality traits. Refine yourself.</em></p>\n\n<p>We need to remember that just because something is good for us sometimes, or even most of the time, doesn’t mean it’s the best move all the time. Coming back to chess for a moment, even though a queen is the most valuable piece on the board, bringing it out early is often considered a misplay.</p>\n\n<p><em>Even the most positive and powerful habits can be misused.</em></p>\n\n<h2 id=\"iii-parting-words\">III. Parting words<a href=\"#iii-parting-words\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Sometimes you need to go beyond “am I following the rules I’ve laid out for myself” and ask “are these rules getting in my way?”</p>\n\n<p>And do so without throwing it all out. Instead, get more nuanced with your system—make improvements. Don’t tear things down to the foundations because you sometimes get caught on a nail poking out of the wall.</p>\n\n<p><em>In many cases, the first step towards victory is not relentless pursuit, but getting out of your own way so you have the opportunity to do something extraordinary.</em></p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/chess-discovery",
            "summary": "Sometimes you need to get out of your own way to unleash your potential.",
            "date_published": "2021-07-10 00:00:00 +0000"
            
        },

        {
            "id": "/blog/too-self-aware",
            "title": "Too Self-Aware?",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Self-development—becoming a better version of yourself—is predicated on self-awareness.</p>\n\n<p>After all, how can we improve upon our faults if we are not aware of them?</p>\n\n<p>But, there is a real danger to this. Becoming hyper-focused on yourself and hyper-critical of yourself can quickly lead to negative thought spirals and a distorted view of yourself and the world around you.</p>\n\n<p><em>If self-development is a passion, then we need to have the tools to maintain it long-term.</em></p>\n\n<h2 id=\"i-the-problem-of-self-focus\">I. The problem of self-focus<a href=\"#i-the-problem-of-self-focus\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If you are self-reflective, if you journal, if you consider your actions in-moment, you will end up spending a lot of time thinking about yourself. This sort of observation is needed to get a better understanding of ourselves. But, it does come with risk.</p>\n\n<p>If you focus so thoroughly and constantly on yourself, you start to make yourself the center of your own universe.</p>\n\n<p>The reality is you are a member of various tribes. You are a person within communities. But, you may start to see everything else only in relationship to yourself—you become the center of the universe.</p>\n\n<p>With this mentality, actions others take may be viewed through a false lens. You might see simple actions as slights or feel that your reactions are the intentions of others. You may lose focus that everything comes down to interaction—the interplay between multiple people—and that others are not as focused on you as you are on yourself.</p>\n\n<p>Remember that everyone has motivations, passions, desires. That we are all acting to our interests the best that we can. Imagine yourself in the shoes of others, rebuild your empathy, and see yourself as a part of the whole rather than the center of it.</p>\n\n<h2 id=\"ii-hyper-criticality\">II. Hyper-criticality<a href=\"#ii-hyper-criticality\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Like Hank Green says regarding creative productivity<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup>. When you are creating something, “you are gonna know the thing you create better than anyone else will ever know it.”</p>\n\n<p>No one will know what it could have been, what you wanted it to be, the flaws that you still see within it. Everyone else will see it as a finished product, they take it as a whole, and only the most critical will seek out flaws or missed potential.</p>\n\n<p>Only you will continue to look at it knowing what you would have done next and where you think you made a mistake.</p>\n\n<p>I would imagine even artists with their work in MOMA see a brushstroke they would like to alter right then and there whenever they visit their work.</p>\n\n<p>What happens when instead of a creative piece, you apply that same critical lens—that same developmental lens—to yourself?</p>\n\n<p>This intensely focused self-awareness and overly critical thinking can lead one to focus on all the negatives—all the things they are working to improve. While this may be useful for determining next steps, it can be detrimental to living life.</p>\n\n<p>These thoughts continually polluting your mind can quickly lead to negative thought patterns, feelings of worthlessness or helplessness, an overall lowering of self-esteem.</p>\n\n<p>If self-focus may cause a distorted view of your place in your community, self-criticism may lead to a distorted view of your true value.</p>\n\n<p>If you are trying to develop yourself, if you practice journaling, conscious self-reflection, or anything else that brings a critical lens to your being, you should also practice self-forgiveness, self-acceptance, and gratitude. You should spend some time celebrating your wins, the things you and others value about yourself, and the things you are thankful for. Focus on the whole of yourself. Not just the areas you are working on.</p>\n\n<p><em>Balance the critical and the complimentary.</em></p>\n\n<p>This can give you the strength you need to be happy while allowing you to successfully develop.</p>\n\n<p><em>As much as you focus on who you want to be, you ought to remember the good things about who you already are.</em></p>\n\n<h2 id=\"iii-final-words\">III. Final words<a href=\"#iii-final-words\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Remember to be empathetic towards others and understanding of your place in your community.</p>\n\n<p>Remember that what you feel may not reflect reality and that you must observe yourself as a whole, not only the aspects you are working to change.</p>\n\n<p><em>Be kind to yourself.</em> Lasting change comes from a place of love.</p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p><a href=\"https://youtu.be/1LAhHDEtTD0?t=170\">The Secret to my Productivity</a> <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">↩</a></p>\n    </li>\n  </ol>\n</div>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/too-self-aware",
            "summary": "As much as you focus on who you want to be, you ought to remember the good things about who you already are.",
            "date_published": "2021-07-03 00:00:00 +0000"
            
        },

        {
            "id": "/two-aspects",
            "title": "The Two Aspects",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>It is my view that there are two aspects to every moment.</p>\n\n<ol>\n  <li>Decision</li>\n  <li>Presence</li>\n</ol>\n\n<p>Mastery of these two aspects is key to living an intentional life.</p>\n\n<p>We exist in this universe in a constant state of observation and interaction. To be intentional with these two abilities is what it means to live.</p>\n\n<h2 id=\"i-decision\">I. Decision<a href=\"#i-decision\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>We decide how we spend our time. Even right now, reading this post is a decision you are making. Are you being deliberate with that decision?</p>\n\n<p>Pause for a moment and decide if you think reading the rest of this post will be valuable for you—if it will improve your life.</p>\n\n<p><em>Be intentional.</em></p>\n\n<hr>\n\n<p>Making that decision is the first principle of intentional living. To be certain in the decisions you are making—how you spend your time.</p>\n\n<p>Decision leads to taking deliberate action. Being deliberate with actions will give you great conviction and confidence in how you are spending your time.</p>\n\n<p>Through this practice, you will always have a clear answer to the question “Why?”</p>\n\n<p>You might make mistakes—some decisions will turn out to be wrong—but nonetheless, you act with conviction.</p>\n\n<hr>\n\n<p>What does it feel like when we’re not being deliberate in our decisions?</p>\n\n<p>It feels like living life on autopilot—not being conscious of our actions, merely coasting. It feels like being an observer of our own lives. A side-kick to someone else’s protagonist.</p>\n\n<p>Without deliberate decision, we are living our lives in the passenger seat.</p>\n\n<h2 id=\"ii-presence\">II. Presence<a href=\"#ii-presence\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Since you’ve started reading this, have any questions come to mind?</p>\n\n<p>Are you thinking about an email you need to respond to? A birthday that’s coming up? Are you really focusing on these words, reflecting on them, and integrating them into your perspective? Or, are you distracted or consuming without consideration?</p>\n\n<p>Take a breath. Take a moment to write down all those thoughts that are polluting your mind. All those things you’re afraid to forget.</p>\n\n<p>Take another breath. Make sure that you are engaging with these words. When we consume without consideration we experience only a fraction of what life can provide us.</p>\n\n<p>Clear your mind and focus on the action you’re taking—on the decision you’ve made.</p>\n\n<p>Try to read the rest of this without distraction. Be present.</p>\n\n<hr>\n\n<p>Once you have made a decision, you must now observe it.</p>\n\n<p>With strong enough confidence in your decision you should feel no doubts, and with no doubts polluting your mind you can focus entirely on the moment at hand. Enjoy it.</p>\n\n<p>You should aim to be mindful. Present. Conscious.</p>\n\n<hr>\n\n<p>What does it feel like when we’re not being present in the moment?</p>\n\n<p>It feels like wading through muck. Like our mind is being polluted and we’re being bogged down. It can feel manic, or it can feel overly relaxed.</p>\n\n<p>Sometimes we can hardly focus because we are so distracted by other thoughts.</p>\n\n<p>Sometimes we can hardly focus because we are consuming without consideration—our brains are shut off.</p>\n\n<h2 id=\"iii-when-all-is-right\">III. When all is right<a href=\"#iii-when-all-is-right\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>What does it feel like when these two aspects are in harmony?</p>\n\n<p><em>Flow.</em></p>\n\n<p>You should feel accepting of yourself and those things outside of your control. You should feel confident in the decisions you are making. You should feel like you are doing what you’re meant to be doing. And you should feel focused in the moment.</p>\n\n<p>This state is hard to maintain over long periods. Our minds have the tendency to fall into routine—stability. We have the tendency to avoid the overhead of being present in our decisions and actions.</p>\n\n<p>The first step is being aware when we’ve fallen back into unconscious experience.</p>\n\n<p>Once we’ve mastered that we can focus on engaging with this world in a far more intentional manner.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/the-two-aspects",
            "summary": "There are two aspects to every moment: Decision, and presence. Master them.",
            "date_published": "2021-06-26 00:00:00 +0000"
            
        },

        {
            "id": "/blog/ask-for-happiness",
            "title": "Ask for Happiness",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Note: This was originally posted as a <a href=\"https://twitter.com/connorjrobbins/status/1408413425043005444\">tweet thread</a>.</p>\n\n<hr>\n\n<p>People give up on a lot of happiness by not being honest about what they want.</p>\n\n<p>Or by being too afraid to ask for it.</p>\n\n<hr>\n\n<p>A friend of mine was conflicted recently.</p>\n\n<p>She unexpectedly ran into an old friend—someone she once had feelings for.</p>\n\n<p>During the conversation, she hinted that he should reach out to catch up sometime.</p>\n\n<p>By the next day, he hadn’t yet texted her.</p>\n\n<hr>\n\n<p>Maybe he was busy and didn’t want to appear distracted if he started a conversation.</p>\n\n<p>Or, maybe he once had feelings for her too, and now he was too nervous to reach out.</p>\n\n<p>Where did your mind first go? What assumption did you make about this situation?</p>\n\n<hr>\n\n<p>What was her assumption?</p>\n\n<p>She decided he must not have any interest in her.</p>\n\n<hr>\n\n<p>She gave up on potential happiness based on a negative assumption. And for what?</p>\n\n<p>To avoid <em>the chance</em> that she might face rejection?</p>\n\n<hr>\n\n<p>After our talk, what did she do? We’ll get there.</p>\n\n<p>First, let’s talk about how this story applies to you.</p>\n\n<hr>\n\n<p>People are so afraid of short-term loss or pain that they would give up on any amount of potential happiness—even happiness that could last the rest of their life—rather than face the chance of having their ego bruised.</p>\n\n<hr>\n\n<p>No great reward comes without risk.</p>\n\n<p>Having the confidence to put your ego on the line and the resilience to handle short-term pain well is an incredible advantage in life.</p>\n\n<hr>\n\n<p>When you think about it, an ego bruise is the least costly risk you could incur.</p>\n\n<hr>\n\n<p>If you feel resistance to an action, if you notice yourself talking yourself out of something, take a second to think.</p>\n\n<p>🧠 What assumptions am I making that might not be true?<br>\n🎱 Am I rationalizing my behavior?<br>\n⬆️ What’s the best-case scenario?<br>\n⬇️ What’s the worst-case scenario?</p>\n\n<hr>\n\n<p>What am I risking, and for what reward?</p>\n\n<hr>\n\n<p>So what did she do after our talk?</p>\n\n<p>She texted him first.</p>\n\n<p>He texted her back.</p>\n\n<p>How did everything resolve? That’s a story for another time…</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/ask-for-happiness",
            "summary": "People give up on a lot of happiness by not being honest about what they want.\n\nOr by being too afraid to ask for it.",
            "date_published": "2021-06-25 00:00:00 +0000"
            
        },

        {
            "id": "/blog/opportunity-does-not-exist-in-a-vacuum",
            "title": "Opportunity Does Not Exist in a Vacuum",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Recently, I hit publish on a tweet:</p>\n\n<blockquote>\n  <p>Opportunity does not exist in a vacuum.</p>\n\n  <p>- <a href=\"https://twitter.com/connorjrobbins/status/1398658393531953154\">@connorjrobbins</a></p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/TruthOfSigns/status/1398716947756376069\">@TruthOfSigns</a> was curious to hear more, so I decided to take down some thoughts.</p>\n\n<hr>\n\n<p>First, what did I mean by this?</p>\n\n<p>I think many people are attracted to the idea of solitary success. They want to lock themselves up in their <a href=\"https://en.wikipedia.org/wiki/Menlo_Park,_New_Jersey\">Menlo Lab</a> and come out with an invention that will change the world.</p>\n\n<p>Perhaps they won’t tell anyone where they are or what they are working on due to a <a href=\"https://www.connorjrobbins.com/blog/fear-of-failure\">fear of failure</a> or an ego-driven desire to shock and awe people once they’ve finished.</p>\n\n<p>I’d argue this is the wrong approach. While solitary deep work is necessary, it is not sufficient. And, while there is nothing inherently wrong with leading a solitary existence, <strong>extraordinary things rarely happen to those who work this way.</strong></p>\n\n<p>So when I say opportunity does not exist in a vacuum, I mean a few things:</p>\n\n<ul>\n  <li>Most great successes come from a network of people.</li>\n  <li>Most opportunity comes from producing value for others.</li>\n  <li>The greatest way to increase our probability to achieve incredible things is by increasing our potential exposure to right-tail occurrences. And this is best achieved through meaningful relationships with other people.</li>\n</ul>\n\n<h2 id=\"i-the-myth-of-the-solitary-success\">I. The myth of the solitary success<a href=\"#i-the-myth-of-the-solitary-success\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>When we think of extraordinary achievements, we often attribute them to a single person.</p>\n\n<p>The stories of CEOs, politicians, or athletes are often told as if through sheer determination, willpower, and discipline, they alone managed to achieve their goals. That they, and <em>they alone</em> put in the work required to achieve something truly extraordinary.</p>\n\n<p>Of course, if you read a more complete biography, it becomes clear that this isn’t the case.</p>\n\n<p>But when it comes to complex narratives, we tend to simplify. It creates a cleaner story and one that people can more easily identify with. And so we reduce or remove altogether the impact that luck and others had in their success.</p>\n\n<p>If you’re not careful, it’s easy to buy into this myth. And once you’ve bought in and shut yourself away, your chances of achieving your dreams are significantly reduced.</p>\n\n<hr>\n\n<p>Maybe the area this myth is most perpetuated is in writing.</p>\n\n<p>There’s this idea of a writer as a solitary figure. Someone that shuts the door to the world to create their magnum opus.</p>\n\n<p>But the truth for most writers is different.</p>\n\n<p>Yes, there is a lot of time spent at the desk, alone, writing. But there is also time spent reading and learning from the greats, and discussing the craft with their peers. They research and interview, they draw on experiences from their life, the perspectives of their friends. Even in the process of writing others are often involved—stories pitched and discussed, editors making suggestions.</p>\n\n<p>We like to imagine it otherwise, but very rarely is a novel the creation of a sole individual.</p>\n\n<p>Even ignoring the impact of editors, publishers, marketers, typesetters, designers, etc. a far simpler truth showing the communal nature of the creation remains:</p>\n\n<p><em>The writers that shut themselves away from experiences to have more time to write quickly finds they have nothing worth writing about.</em></p>\n\n<p>I believe this truth applies far more generally as well.</p>\n\n<h2 id=\"ii-the-external-nature-of-opportunity\">II. The external nature of opportunity<a href=\"#ii-the-external-nature-of-opportunity\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Opportunity is simply a favorable circumstance—a chance occurrence, often something that provides us with progress or advancement of some kind.</p>\n\n<p>When we talk about opportunity, we might be talking about:</p>\n\n<ul>\n  <li>A promotion</li>\n  <li>The chance to pitch our idea to an investor</li>\n  <li>An invitation to speak at a conference</li>\n  <li>Cancellation of plans giving us time to write</li>\n</ul>\n\n<p>In essence, some chance occurrence that seems to favor our goals for personal fulfillment.</p>\n\n<p>Note that all those examples involve other people. And also, note that even in a case where we create an opportunity for ourselves, an opportunity cost exists.</p>\n\n<p>So, opportunity does not exist in a vacuum. Either it involves other people (which is very common) or, you are doing something which excludes others (and thus indirectly impacts them).</p>\n\n<p>We cannot escape the fact that we all live in communities of producers. And so, everything we do is relative to the rest.</p>\n\n<p>With this understanding, we can make the most of it.</p>\n\n<h2 id=\"iii-the-nature-of-extraordinary-things\">III. The nature of extraordinary things<a href=\"#iii-the-nature-of-extraordinary-things\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If we want to experience something extraordinary in our lives, we must first understand that it’s unlikely. The rarer the experience, the higher proportion luck plays a role.</p>\n\n<p>At the same time, realize that even the most outlandish things are still possible, and there are ways to improve your lifetime odds.</p>\n\n<p>Imagine you have a coin to flip as many times as you like. Your goal is to get five tails in a row.</p>\n\n<p>If you flip the coin only once, you certainly won’t achieve your goal.</p>\n\n<p>If you flip the coin five times in a row, the chance that exactly those five attempts all show tails is only about <a href=\"https://www.wolframalpha.com/input/?i=5+tails+in+a+row\">3%</a>.</p>\n\n<p>If you flip the coin one hundred times, the chance of achieving your goal of five tails in a row is about <a href=\"https://www.wolframalpha.com/input/?i=5+consecutive+tails+in+100+flips\">81%</a>.</p>\n\n<hr>\n\n<p>Like a coin toss, opportunity can be thought of as the outcome of a probabilistic chemical reaction between at least two people.</p>\n\n<p>Every meaningful engagement you have can be thought of as a flip of a coin. Sometimes something extraordinary happening requires a certain number of matching faces to come up at once.</p>\n\n<p>Therefore, the more people we are in touch with, the closer we are with them, and the more frequently we engage with the external world, naturally the higher the probability for extraordinary experiences becomes.</p>\n\n<p>As a more concrete example—if extraordinary things happen by being in the right place at the right time, then we must find a way to be in many places, all the time.</p>\n\n<p>Then it’s a good thing you have friends in all sorts of places.</p>\n\n<p>If you’re on the mind of other people, you’re essentially in many places always. You’re then more likely to be in the right place at the right time, even if someone else is acting as the conduit.</p>\n\n<p>Likewise, you should have others on your mind at all times. A whole new sort of opportunity opens up when you can pass along something extraordinary to someone you care for.</p>\n\n<p>We all want to experience incredible things, and we should help each other do just that. Regardless, one thing is certain: Very rarely does an extraordinary opportunity arise when you’re keeping everything to yourself.</p>\n\n<h2 id=\"iii-chaos-and-maximizing-tail-potential-aka-manufacturing-serendipity\">III. Chaos and maximizing tail potential (aka. manufacturing serendipity)<a href=\"#iii-chaos-and-maximizing-tail-potential-aka-manufacturing-serendipity\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Who do you think opportunity comes more readily to:</p>\n\n<ul>\n  <li>Someone who craves stability, talks to the same five friends only about the same topics of interest, and keeps what they’re working on to themselves</li>\n  <li>Someone who craves novel experiences, keeps in touch with many people from various social circles and walks of life, and shares openly and honestly the ideas they have and the projects they’re working on</li>\n</ul>\n\n<p>The moral of the story is short:</p>\n\n<p><em>The more engaged you are with the external world, the more opportunity you will find.</em></p>\n\n<p>Increase the potential for a brilliant chemical reaction in your life.</p>\n\n<p>Think of your friends often, make a habit of reaching out to those you care about, and when an opportunity arises, think about who you might want to share it with.</p>\n\n<p>It doesn’t take a lot of time, but this kind of generosity is rare and rewarded.</p>\n\n<p><em>Spend time on your external world, and your internal world will thank you.</em></p>\n\n<h2 id=\"iv-actionable-advice\">IV. Actionable advice<a href=\"#iv-actionable-advice\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Make a habit of generosity.</p>\n\n<p>We aren’t alone in this universe—our achievements aren’t solitary. Help others, and you will benefit greatly, not just from the personal fulfillment that serving brings, but because others will turn to help you in kind.</p>\n\n<p>Take the time to understand what your friends seek, and do your best to help them find it.</p>\n\n<p>At first, it may be a habit you need to focus on, some time to block off once a week to think creatively about these opportunities. But soon, whenever an opportunity arises, your friends will be top of mind.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/opportunity-does-not-exist-in-a-vacuum",
            "summary": "Extraordinary things rarely happen to those who work in isolation.",
            "date_published": "2021-06-19 00:00:00 +0000"
            
        },

        {
            "id": "/blog/fear-of-failure",
            "title": "Fear of Failure",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>You’re about to make a decision, or maybe you already have, and now you’re faced with dread.</p>\n\n<p>What was once a dream is now beginning to be reality.</p>\n\n<hr>\n\n<p>When something exists only as a dream, it is perfect, flawless, a fantasy we are free to enjoy.</p>\n\n<p>But once we make the decision, we thrust it into reality, and suddenly anything can happen.</p>\n\n<p>It has the potential to sink or swim. There is suddenly the possibility of failure.</p>\n\n<p>But, this stress is doing us no good. At best, it will be a nagging fear in the back of our mind, and at worst, it can lead to poor judgment and a greater chance of failure.</p>\n\n<p>How do we rid ourselves of this fear?</p>\n\n<h2 id=\"i-forgive-yourself\">I. Forgive yourself<a href=\"#i-forgive-yourself\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>First, understand that you’re not alone. Fear of failure is a form of stress that just about everyone has had to face at one point or another.</p>\n\n<p>You’re not broken.</p>\n\n<p>Don’t try to outright dismiss the fear or ignore it. This will only make things worse.</p>\n\n<p>We often try to discount our emotions in various ways, to set them aside.</p>\n\n<p>“This is stupid. This project isn’t even worth worrying about. Why do I feel this way?”</p>\n\n<p>“So-and-so never seems stressed. I should be more like them and push through.”</p>\n\n<p>Accept your emotions for what they are.</p>\n\n<p><strong>You can only improve your situation if you come at it from a place of radical honesty.</strong></p>\n\n<p>Give yourself the freedom to examine without self-judgment—the freedom to experience your emotions thoroughly and accurately. Only then begin to critically examine them.</p>\n\n<h2 id=\"ii-the-fear-could-be-a-positive-indication\">II. The fear could be a positive indication<a href=\"#ii-the-fear-could-be-a-positive-indication\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If someone challenged you to a bowling pin balancing competition, chances are you’d have no fear of failure. You may be competitive about it, but you wouldn’t be <em>afraid to fail.</em></p>\n\n<p>Why is that?</p>\n\n<p>Because it’s a meaningless task. It’s not something you’ve tied to your ego, it’s not something you’re worried about others judging you for, and it’s not something you perceive as having any impact on your life.</p>\n\n<hr>\n\n<p>But you’re feeling fear now, whether about a presentation, or a project, or a new business venture. So why is that?</p>\n\n<p>Examine the fear you’re feeling for a moment. Where is it coming from?</p>\n\n<p>Sometimes this fear is an indication that we are starting down a path that feels <em>meaningful</em> to us. It’s something important.</p>\n\n<p>And what better way is there to live than to spend your time on <em>meaningful experiences.</em></p>\n\n<p>So if you are feeling fear of failure, it could very well be a positive indication:</p>\n\n<p><strong>You are heading down the right path.</strong></p>\n\n<h2 id=\"iii-quelling-the-fear\">III. Quelling the fear<a href=\"#iii-quelling-the-fear\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>The above realization may provide you some peace. But it’s unlikely to rid you of this fear altogether. (And rightfully so.)</p>\n\n<p>To further reduce this fear, try to dig further. Let’s get to the roots of it.</p>\n\n<p>Have you started a new job? Maybe this fear stems from feeling <em>you don’t yet have the skills to succeed?</em></p>\n\n<p>Are you starting a podcast? Maybe the root is a worry that <em>no one will listen?</em></p>\n\n<p>With each answer, ask yourself whether it’s something you can control.</p>\n\n<p>In the case of starting a new job, the fear that you might not yet have the skills to succeed may be rational. Likewise, it’s something you can control.</p>\n\n<p>Find peers at work that are willing to act as a mentor. Find educational resources and make a plan to work through them. Communicate openly and honestly with your team.</p>\n\n<p><em>In many cases, the act of planning alone can significantly quell anxiety.</em></p>\n\n<p>For the case of the podcast, the worry that no one will listen is rational, but it’s not something you can directly control.</p>\n\n<p>So what can you control that might improve the odds of people listening?</p>\n\n<p>Dedicate some time to brainstorm ways to get the word out. Focus your attention on the actions you <em>can</em> take that will improve the probability of success.</p>\n\n<h2 id=\"iv-regardless-of-outcome\">IV. Regardless of outcome<a href=\"#iv-regardless-of-outcome\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>When you focus on what you have control over, you stop being a dreamer and a worrier. Instead, you become someone taking action—someone that is actively altering outcomes.</p>\n\n<p>You’ll be able to focus on education and actions—elements that will make you a better person, improving the likelihood of success for not just this dream, but every dream that follows it.</p>\n\n<p>Regardless of what happens, working on this goal will have a real and meaningful effect on you.</p>\n\n<p><strong><em>Focus on the right things. Even in failure, you’ll succeed.</em></strong></p>\n\n<h2 id=\"v-in-short\">V. In short<a href=\"#v-in-short\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<ol>\n  <li>Without self-judgment, experience your emotions <em>openly and honestly.</em>\n</li>\n  <li>Realize the fear is a <em>positive indication.</em>\n</li>\n  <li>Search for the <em>roots of the fear.</em>\n</li>\n  <li>Create a plan of action targeting what you <em>have control over.</em>\n</li>\n  <li>Regardless of your end goal, <em>remember what you’re doing is self-improvement.</em>\n</li>\n</ol>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/fear-of-failure",
            "summary": "You know this stress is doing you no good. But how do we rid ourselves of this fear?",
            "date_published": "2021-06-12 00:00:00 +0000"
            
        },

        {
            "id": "/blog/dont-be-fooled-by-negativity",
            "title": "Don’t Be Fooled by Negativity",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>If your mind is the root of who you are, then the content you feed your mind is deeply connected with how you feel, and how you act.</p>\n\n<p><strong>Are you allowing your mind to be polluted with negativity?</strong></p>\n\n<hr>\n\n<h2 id=\"i-our-brains-love-negativity\">I. Our brains love negativity<a href=\"#i-our-brains-love-negativity\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>How often do you find yourself seeking out and engaging with content that will inspire you, uplift you, or otherwise leave you feeling better than you did before?</p>\n\n<p><strong>How often do you find yourself doom-scrolling?</strong></p>\n\n<p>Next time you’re scrolling through the news, or social media, take a second to examine what content catches your attention the most.</p>\n\n<p><em>Chances are it won’t be the uplifting posts.</em></p>\n\n<p>By default, most people are pre-disposed to engage with negative content. It’s a quirk of the human brain.</p>\n\n<p>There’s a reason people love to bond over shared hatred towards a tv show, politician, or idea.</p>\n\n<p><em>There’s a reason we spend so much time obsessing over everything wrong with this world.</em></p>\n\n<h2 id=\"ii-creators-know-this\">II. Creators know this…<a href=\"#ii-creators-know-this\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>and everyone else is left picking up the bill.</p>\n\n<p>If you investigate the art and science of copywriting, or more generally, content creation and growth/engagement strategies, chances are you’ll come across this advice: <strong>Use negative emotions to your advantage.</strong></p>\n\n<p>Whether it’s advertisements reminding you of what you don’t have, news outlets re-framing events to their most negative form, or content creators focusing on things they hate rather than what they love—<u>negativity works.</u></p>\n\n<p>As a quick experiment which of these two statements causes a more visceral reaction in you:</p>\n\n<ol>\n  <li>The one habit all billionaires share.</li>\n  <li>Don’t have this one habit? Enjoy being poor…</li>\n</ol>\n\n<p>It’s easy to get attention if you employ this method. But at what cost?</p>\n\n<p>The best marketers understand this power, and <em>the least ethical employ it liberally.</em></p>\n\n<h2 id=\"iii-but-you-still-have-a-choice\">III. But you still have a choice<a href=\"#iii-but-you-still-have-a-choice\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>While algorithms, ads, and marketers may often decide what gets placed in front of our eyes, we still have the choice of what to engage in.</p>\n\n<p><strong>If attention is currency, we have the choice of where to spend it.</strong></p>\n\n<p><em>You</em> decide what posts you like, telling the algorithm what you want to see more of. <em>You</em> get to decide whether to spend time reading the replies to a news story that distresses you. <em>You</em> can turn it all off and pick up a good book.</p>\n\n<p>No matter the narrative others try to push, <em>you</em> have a choice.</p>\n\n<h2 id=\"iv-is-it-worth-it\">IV. Is it worth it?<a href=\"#iv-is-it-worth-it\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If we have a choice of what to engage with, how do we make the determination?</p>\n\n<p>Take account of the content you consume.</p>\n\n<p>Next time you’re going to scroll through Twitter, note down how you feel before and after.</p>\n\n<p>Do you feel better, or worse? More informed, or more confused? Optimistic, or pessimistic?</p>\n\n<p>The content you consume should be working for you. It should improve your life, not be a drain on it.</p>\n\n<p><strong>A little reflection and curation will do wonders.</strong></p>\n\n<h2 id=\"v-isnt-it-sometimes-worth-it\">V. Isn’t it sometimes worth it?<a href=\"#v-isnt-it-sometimes-worth-it\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>I don’t mean to discourage staying up-to-date on world events or gaining a better understanding of our fellow man.</p>\n\n<p>Sometimes deeply negative things deserve our attention and our understanding.</p>\n\n<p><em>But, be intentional about your education.</em></p>\n\n<p>Often, negative emotions can be a catalyst for change. Either internally, or in a grander sense.</p>\n\n<p>This is most certainly a good thing.</p>\n\n<p>But understand the cost associated with it. Your well-being has value. Ask yourself: “What is this costing me, and what am I and the world getting out of it?”</p>\n\n<p>If you’re going to invest your time, your happiness, and your well-being in something, it better be worth it.</p>\n\n<h2 id=\"vi-do-what-you-can\">VI. Do what you can<a href=\"#vi-do-what-you-can\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Sometimes it’s worth investing time and energy in something negative if it will inform our perspective or improve the world.</p>\n\n<p>For example, understanding social injustices, and climate change, is probably worth your time and energy.</p>\n\n<p><em>But, you can be more intentional about it.</em></p>\n\n<p>If you want to be informed on a topic, is scrolling the endless negative replies to a news story the best way to achieve that goal?</p>\n\n<p>Chances are you’d be better off reading a book or two on the topic. It’ll be far less emotionally charged, and far more informative.</p>\n\n<p>If you want to make an impact—change the world—is dedicating several hours a day to doom-scrolling and feeling bad the best way to achieve that goal?</p>\n\n<p>Research what steps you can take, and which organizations you can support to make a meaningful change, and close the tweet that does nothing other than drain your optimism.</p>\n\n<h2 id=\"vii-leave-the-rest\">VII. Leave the rest<a href=\"#vii-leave-the-rest\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Finally, understand your limitations.</p>\n\n<p>There are only so many hours in a day, and there is only so much of yourself emotionally for you to give.</p>\n\n<p><em>We can’t know everything, and we can’t fix everything.</em></p>\n\n<p><strong>What are you willing and able to commit to?</strong></p>\n\n<p>There is no sense in spending hours a day feeling terrible about American politics when you’re a citizen of Ireland. Find an action you can take, find a meaningful way to get informed, and leave the rest.</p>\n\n<p>For any given topic, effectively understand the issue at hand, and decide if you’re able to make a positive change.</p>\n\n<p><em>Act, or let it go.</em></p>\n\n<p>There is no sense in allowing these things to pollute your mind when you cannot impact them or aren’t committed to acting.</p>\n\n<p>Otherwise, you’ll be investing your well-being for nothing.</p>\n\n<hr>\n\n<h2 id=\"viii-final\">VIII. Final<a href=\"#viii-final\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>There exists an emotional asymmetry in the attention economy.</p>\n\n<p>Content creators can alter the minds of millions, and many are doing so with no real focus on the ethics of their actions.</p>\n\n<p>Recognize when others are playing on your attention with negative emotions.</p>\n\n<p>There can be a strange king of glee in negativity. Don’t fall for it.</p>\n\n<p>It’s insidious.</p>\n\n<p>It may feel fulfilling for a moment, but it will slowly erode the light inside you.</p>\n\n<p><strong><em>Be intentional with your attention.</em></strong></p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/dont-be-fooled-by-negativity",
            "summary": "Are you allowing your mind to be polluted with negativity?",
            "date_published": "2021-06-05 00:00:00 +0000"
            
        },

        {
            "id": "/blog/dont-sweat-the-devil-in-the-detail",
            "title": "Useful Contradiction: Don’t Sweat the Devil in the Detail",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Life is often rife with contradiction. This holds especially true in the common words of wisdom we hear.</p>\n\n<p>It seems for every piece of wisdom someone preaches, someone else preaches the exact opposite.</p>\n\n<p>But does this mean that these ideas are opposed? Irreconcilable?</p>\n\n<p>Must we pick one or the other?</p>\n\n<p>Take these two common pieces of advice:</p>\n\n<ol>\n  <li>Don’t sweat the small stuff</li>\n  <li>The Devil is in the detail</li>\n</ol>\n\n<p>Are they really as opposed as they appear at first glance?</p>\n\n<p>Let’s see.</p>\n\n<h2 id=\"i-dont-sweat-the-small-stuff\">I. Don’t sweat the small stuff<a href=\"#i-dont-sweat-the-small-stuff\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>We often hear: Remember to <strong>zoom out.</strong> Keep an eye on the <strong>big picture.</strong> Focus on the <strong>vision.</strong> Don’t lose the forest for the trees.</p>\n\n<p>In essence, <em>don’t sweat the small stuff.</em></p>\n\n<p>We hear echoes of this mantra in other recommendations like the Pareto principle, the 80/20 rule. Don’t worry about that 80%, it doesn’t provide much value. Those details don’t matter.</p>\n\n<p>With this in mind, it’s easy to turn away from the details in favor of grander brush strokes.</p>\n\n<h2 id=\"ii-the-devil-is-in-the-details\">II. The Devil is in the details<a href=\"#ii-the-devil-is-in-the-details\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Sometimes the smallest detail missed is all it takes for a project to crumble.</p>\n\n<p>Not only is there often a great risk in the detail, but it’s also where you can find great value.</p>\n\n<p>Don’t avoid the details, don’t shrug either the responsibility or the potential value. Instead, practice deep work, dig in, find something that no one has found before, that no one had given the requisite focus to find.</p>\n\n<h2 id=\"iii-the-contradiction\">III. The contradiction<a href=\"#iii-the-contradiction\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Do I focus on the details or not?</p>\n\n<h2 id=\"iv-the-synthesis\">IV. The synthesis<a href=\"#iv-the-synthesis\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Like most advice, it’s likely the one that you feel opposed to that you should take.</p>\n\n<p>Are you the type of person that focuses on the big picture? That ignores the potential value that can come from grinding in the details? “The Devil is in the detail” is for you.</p>\n\n<p>So you get caught up in the small things? Go down rabbit holes? Are you a perfectionist who has trouble pressing “publish”? “Don’t sweat the small stuff” is for you.</p>\n\n<p>Understand your personality, what methodology you are biased towards, and try to find value in a counter-intuitive (to you) view.</p>\n\n<hr>\n\n<p>Looking just a little further, we can also see how these ideas may hint at a more fruitful recommendation:</p>\n\n<p><em>Focus on the right details.</em></p>\n\n<p>Set targets without sweating the small stuff. Execute work checking for the Devil in the detail.</p>\n\n<p>Before you begin your work, ask yourself “What am I hoping to achieve?” Begin only when you’ve reached an answer. Then while you work on the details, always keep that outcome in mind. Never stray too far from the original intention.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/dont-sweat-the-devil-in-the-detail",
            "summary": "Some advice may be both a contradiction and useful.",
            "date_published": "2021-05-29 00:00:00 +0000"
            
        },

        {
            "id": "/blog/there-are-no-shortcuts",
            "title": "There Are No Shortcuts",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Do the work.</p>\n\n<p><u>There is no substitute.</u></p>\n\n<p>Many are told, “work smarter not harder,” and from this seek shortcuts where there are none. They avoid the <em>work</em> by focusing on the <em>process.</em> They try to find the most effective way to do what they hope while making no progress.</p>\n\n<p>While they try to discover the most effective way to run a race, others continue to lap them.</p>\n\n<p>(And those others learn to speed up with every lap they complete.)</p>\n\n<h2 id=\"i-the-right-time-to-improve\">I. The right time to improve<a href=\"#i-the-right-time-to-improve\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>The right time to improve—to learn how to be more efficient—is once you’ve already started. Once you have the practical and thorough knowledge of what you’re trying to change.</p>\n\n<p>Once you’ve begun taking action, then it is easiest to implement change. Only when you’re acting are you then able to apply the knowledge.</p>\n\n<p>The lessons are practical—no longer theoretical.</p>\n\n<h2 id=\"ii-why-there-are-no-shortcuts\">II. Why there are no shortcuts<a href=\"#ii-why-there-are-no-shortcuts\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If you seek wealth—whether in money, friendship, love, experiences—the only way is through providing value to the world. Ironically, the predicate of wealth is not greed but generosity.</p>\n\n<p>Living a life of service is what brings you wealth.</p>\n\n<ul>\n  <li>To have wealth in relationships, you must give love.</li>\n  <li>To have wealth in experiences, you must spend your time.</li>\n  <li>To have wealth in money, you must create value.</li>\n</ul>\n\n<hr>\n\n<p>There is no shortcut. There is no something for nothing.</p>\n\n<p><em>There is no free lunch.</em></p>\n\n<p>If you’re worried about starting off on the right foot, remember this:</p>\n\n<p>Starting <em>is</em> a good start.</p>\n\n<p>(And if you want to work smarter, focus on that after you’ve completed a few laps.)</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/there-are-no-shortcuts",
            "summary": "Do the work. There is no substitute.",
            "date_published": "2021-05-22 00:00:00 +0000"
            
        },

        {
            "id": "/blog/have-a-portfolio",
            "title": "Have a Portfolio",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>The only thing worse than getting caught red-handed is getting caught empty-handed.</p>\n\n<p>Create a portfolio.</p>\n\n<p>When most people think of a portfolio they think of the traditional portfolio of a painter. But I mean portfolio in a more general sense of the word. Any body of publicly available work can be considered a portfolio.</p>\n\n<p>If you’re a data scientist it may be some models you’ve created and the analysis write-up that goes along with it. If you’re a writer it may be some flash fiction or articles you’ve written. Even someone as unlikely to have a portfolio as an accountant may publish their thoughts on how IFRS will impact the particular industry they’re most expert at.</p>\n\n<p>No matter what your career, by-work, or passions may be, I am certain there is a way you can compile some records that act as a publicly available portfolio. (Or at the very least, a portfolio you’ll be able to show on request.)</p>\n\n<p>If this concept in general interests you, I would recommend checking out <a href=\"https://perell.com/\">David Perell</a> who is a known proponent of writing as a means of career development.</p>\n\n<p>Here are some reasons why, regardless of who you are, you should have a portfolio.</p>\n\n<h2 id=\"i-the-immediate-value-of-starting\">I. The immediate value of starting<a href=\"#i-the-immediate-value-of-starting\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Starting something isn’t hard. And yet most people never do it.</p>\n\n<p>You can go from having zero online presence to having a blog online in less than 20 minutes and for no money down. And yet, there is a large group of people who say “someday I’ll sit down and start that blog.”</p>\n\n<p>Again, for most things, starting isn’t hard.</p>\n\n<p><em>And yet, most people never start.</em></p>\n\n<p>This means if you do start it’s an immediate signal.</p>\n\n<p>Doing work that wasn’t asked of you is an indication others cannot ignore.</p>\n\n<p>Once you’ve begun, even if you feel you haven’t yet achieved anything, the mere act of starting is a major indicator for others.</p>\n\n<p>Don’t believe me? Imagine for a moment that you’re a relatively successful musician and you open up Twitter to see these two DMs.</p>\n\n<blockquote>\n  <p>“Hey, <strong>I have a podcast</strong> where every week we interview a new musician in the NYC area. We’d love to have you on. Are you available to chat next Tuesday at …”</p>\n</blockquote>\n\n<blockquote>\n  <p>“Hey, <strong>I’m planning on starting a podcast</strong> in the next 6 months where we interview a new musician in the …”</p>\n</blockquote>\n\n<p>Which of those two is going to get a response?</p>\n\n<p>(Or, at the very least, merit further investigation.)</p>\n\n<h2 id=\"ii-be-prepared\">II. Be prepared<a href=\"#ii-be-prepared\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>A screenwriter friend of mine once talked himself into a party. Soon enough he was rubbing elbows with some big shots and eventually he was engaged in a conversation with the head of a major network.</p>\n\n<p>He had done it.</p>\n\n<p>He had done what most screenwriters only ever hope to achieve. Here he was talking to someone that had the money, and the decision making ability, to turn a script into a movie.</p>\n\n<p>And so this exec asked him “Do you have anything I could read?”</p>\n\n<p>…</p>\n\n<p><em>He hadn’t finished a script.</em></p>\n\n<p>The only thing worse than being caught red-handed is being caught empty-handed.</p>\n\n<p>We often spend so much time focusing on how to optimize our path to success that we forget one minor detail: Doing the work.</p>\n\n<p>Having a portfolio enforces that detail. To have a portfolio, you need to have done the work to bring it into existence.</p>\n\n<p>It’s obvious, but if you plan to network, if you plan to make partnerships, then it’s in your best interest to <em>be prepared.</em></p>\n\n<p>As <a href=\"https://twitter.com/shl\">Sahil</a> would say:</p>\n\n<blockquote>\n  <p>Let your work network for you, then let your network work for you.</p>\n</blockquote>\n\n<p>Next time you find yourself in the same room as someone that can help take you to the next level, <em>make sure you have a script they can read.</em></p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/have-a-portfolio",
            "summary": "The only thing worse than getting caught red-handed is getting caught empty-handed.",
            "date_published": "2021-05-16 00:00:00 +0000"
            
        },

        {
            "id": "/blog/what-do-you-desire",
            "title": "What Do You Desire",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>In <a href=\"https://twitter.com/JamesABoardman/status/1387887574740516864\">response to a reply tweet</a> James Boardman wrote on Twitter:</p>\n\n<blockquote>\n  <p>A trap that many fall into is focusing on the means to the end rather than the end itself.</p>\n\n  <p>Many want to be entrepreneurs to be free</p>\n\n  <p>But… freedom isn’t about externalities at all. Money and control help, but you reach the state solely through internal means.</p>\n</blockquote>\n\n<hr>\n\n<p>This is a brilliant point to raise in addition to my recent post <a href=\"https://www.connorjrobbins.com/focus-on-the-work\"><em>Focus on the Work</em></a>.</p>\n\n<p>In <em>Focus on the Work,</em> I write about the importance of focusing our goals on action, not achievement—on things that are intrinsically within our control.</p>\n\n<p>I discuss how it can be considered misguided to focus on “being wealthy” while missing the opportunity to focus on budgeting, saving, and investing. That it’s easy to miss the actions for the outcomes.</p>\n\n<p>James’s comment made me consider two additional points.</p>\n\n<h2 id=\"i-what-is-the-true-root-of-our-desire\">I. What is the <em>true</em> root of our desire?<a href=\"#i-what-is-the-true-root-of-our-desire\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Many of us have some idea of what we want—we may have even written it on a Post-it note on our desk. But have we given that sticky piece of paper the reflection it deserves?</p>\n\n<p>Let’s take an example.</p>\n\n<p>Many people may say they want to “start a business.” But why do they want to start a business? “To get rich.”</p>\n\n<p>But why do you want to “get rich?” “So I can have more freedom” And why do you want “more freedom?” “So I can travel the world.”</p>\n\n<p>We could take this train of thought further until we get to the true root of the desire. But let’s assume that traveling the world is this imaginary person’s true desire.</p>\n\n<p>Suddenly we realize that what we thought was our desire (starting a business) was only a hurdle we placed in front of ourselves. Now that we understand the root of our desires (to travel) we can see more clearly what needs to be done. Perhaps we have no interest in business, but we’re more than able to learn about traveling cheaply, we’re more than able to apply for remote work opportunities, we’re more than able to learn how to make the most of our time so we can start learning new languages.</p>\n\n<p>Our desire may be far more achievable than we thought.</p>\n\n<p>Learning the root of your desire opens you up to opportunities you wouldn’t otherwise see. You’ll realize you can avoid the hurdles you placed before yourself simply by walking off the track—you had no desire to be a hurdle jumper to begin with.</p>\n\n<h2 id=\"ii-do-we-have-more-control-than-we-realize\">II. Do we have more control than we realize?<a href=\"#ii-do-we-have-more-control-than-we-realize\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Next, in some cases, we may find we have more control than we expected.</p>\n\n<p>Packing our things and buying a plane ticket are far more controlled operations than trying to start a business.</p>\n\n<p>Or, as James mentioned in his tweet, if your true desire is freedom, you may find you can make great strides from within. While externals may improve your freedom, there are many aspects to it based upon mindset alone—something fully within your grasp.</p>\n\n<hr>\n\n<p>Find the roots of your desire. Ask yourself five consecutive “whys” or as many as it takes to reach some circular reasoning.</p>\n\n<p>You may find what you desire to be a short walk away—just a few steps off the track.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/what-do-you-desire",
            "summary": "You may find what you desire to be a short walk away—just a few steps off the track.",
            "date_published": "2021-05-08 00:00:00 +0000"
            
        },

        {
            "id": "/blog/it-takes-days-not-hours",
            "title": "It takes days, not hours",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Certain things cannot be measured in hours alone. They require more than just time at a desk, but instead long-term dedication. Daily practice. Consistency.</p>\n\n<p>One thing I wish I had learned much younger is that achievement comes—certainly—from consistent effort over a long period. It is that simple.</p>\n\n<p>It’s easy to believe that exponential growth is right around the corner. Or that we can make up for lost time later through extra effort. But these are generally not true. Even cases where these beliefs do come true are more a matter of luck than strategy—those cases cannot be optimized for.</p>\n\n<p>And so, many things are more honestly measured in days, not hours. While the hours are still important, it’s often more important that you spent many days working, even if for each day it was only twenty minutes.</p>\n\n<p>While deep work is crucial in its own right, I’d argue that consistent work serves as a greater foundation. Deep work can be added once consistency is reached.</p>\n\n<h2 id=\"i-the-lives-of-writers\">I. The lives of writers<a href=\"#i-the-lives-of-writers\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>If you study the working lives of writers you’ll find they nearly all have two things in common:</p>\n\n<ol>\n  <li>They spend fewer hours per day writing than you might expect (2-4).</li>\n  <li>They spend more days per year writing than you might expect (nearly every day).</li>\n</ol>\n\n<p>I believe—whether knowingly or not—this comes from an understanding of a simple creative concept:</p>\n\n<p><em>Certain things in life take days, not hours.</em></p>\n\n<p>That is, some things that can only be estimated in days to completion because there is a limit to how many hours you can work before you need to recharge.</p>\n\n<p>Writing is one of these things.</p>\n\n<p>Writing takes a great deal of creative energy. For most people, even many of the greatest writers in history, this energy exhausts after four hours of work.</p>\n\n<p>Each day they are granted four hours of meaningful work. Those four hours either get used, or are lost. There is not saving them up for later.</p>\n\n<h2 id=\"ii-simple-advice\">II. Simple advice<a href=\"#ii-simple-advice\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>All this to say, if you are trying to take something seriously, the one thing you should keep in mind above all else is: Be consistent. Work at it every day.</p>\n\n<p>Understand that there is no making up for lost time. There is no saving your energy for a later day. The sooner you get started the further you’ll be able to go.</p>\n\n<p>Have the patience to understand it will take time. Have the discipline to put in the hours <strong>each day</strong> to make it happen.</p>\n\n<p><em>It takes days, not hours.</em></p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/it-takes-days-not-hours",
            "summary": "One thing I wish I had learned much younger is that achievement comes—certainly—from consistent effort over a long period. It is that simple.",
            "date_published": "2021-05-05 00:00:00 +0000"
            
        },

        {
            "id": "/blog/focus-on-the-work",
            "title": "Focus on the Work",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<h2 id=\"i-the-object-of-our-desire\">I. The object of our desire<a href=\"#i-the-object-of-our-desire\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>A lot of stress can be relieved by asking yourself the right questions.</p>\n\n<p>In a <a href=\"https://twitter.com/connorjrobbins/status/1387046630226944009\">recent tweet</a> I asked:</p>\n\n<blockquote>\n  <p>What is the root of your desire?</p>\n\n  <p>Some say they want to be an entrepreneur when really what they want is to be rich. Or that they want to be an actor when really what they want is to be famous.</p>\n\n  <p>Do you want the work, or the outcome?</p>\n</blockquote>\n\n<p>There’s a lot of pressure placed on us to succeed. Both internally and externally. We have people telling us what they expect of us, society implying who has more value than who, and we tell ourselves constantly what it is we hope to achieve.</p>\n\n<p>But what is it you hope to achieve?</p>\n\n<p>When we ask ourselves this question we may find our focus is placed on the outcome. We want financial independence, we want a promotion, we want others to understand and appreciate our art.</p>\n\n<p><em>We dream not about doing the work, but what having done the work will grant us.</em></p>\n\n<p>We claim to be passionate, but that passion is placed in our future, not in our present.</p>\n\n<p>And, most importantly, it’s placed on things outside of our control.</p>\n\n<p>Think about what you hope to achieve. How many of your answers were not entirely in your control? Winning awards, getting published, being offered a raise.</p>\n\n<p>All of the examples I’ve given so far require outside influence to go your way.</p>\n\n<p>It’s no wonder we feel stressed, so much of what we desire hinges on either chance, or the opinions of other people.</p>\n\n<h2 id=\"ii-control\">II. Control<a href=\"#ii-control\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>A core concept in Stoicism is distinguishing between what is in our control and what is not in our control.</p>\n\n<p>You might recognize this concept from the famous <em>Serenity Prayer</em> originally composed by Reinhold Niebuhr:</p>\n\n<blockquote>\n  <p>God, grant me the serenity to accept the things I cannot change,<br>\ncourage to change the things I can,<br>\nand wisdom to know the difference.</p>\n\n  <p>- Reinhold Niebuh</p>\n</blockquote>\n\n<p>Looking back at those examples, did we have the wisdom to know the difference?</p>\n\n<p>Let’s settle our minds by focusing on the work. By focusing on the aspect of our desires that we can control.</p>\n\n<p>How many of us say that we crave financial independence, but have never looked into our finances, have never drawn up and followed a budget and savings plan?</p>\n\n<p>How many claim they want and deserve a promotion, while at the same time shirking the very step-up opportunities that would get us there with the excuse that “we’re too busy with our other tasks?”</p>\n\n<p>How many want others to appreciate our art while we struggle to put in the hours required to make art worth appreciating?</p>\n\n<p>Switch to a mindset of control. Focus on what is in your ability to change. Focus on the work and the outcome will follow.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><strong>Desire</strong></th>\n      <th><strong>Control</strong></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Financial independence</td>\n      <td>Budget and save</td>\n    </tr>\n    <tr>\n      <td>Promotion at work</td>\n      <td>Prioritize step-up opportunities</td>\n    </tr>\n    <tr>\n      <td>Others to appreciate our art</td>\n      <td>Spend x hours a week creating our art</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"iii-journey\">III. Journey<a href=\"#iii-journey\" class=\"anchor\" aria-hidden=\"true\">§</a>\n</h2>\n\n<p>Focusing on the person we’ll be, the life we’ll live, once the journey concludes can be motivating. But the truth is, the journey never concludes. Which makes it clear that if we’re not enjoying the journey, there will be nothing to look forward to.</p>\n\n<p>Focusing on outcome may feel good, but it often does not inspire action. Movement will occur only when you focus on the steps.</p>\n\n<p>If you’re feeling anxiety over success train your focus on action that is in your control. Create a plan of action and watch the anxiety begin to settle.</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/focus-on-the-work",
            "summary": "Do you want the work, or the outcome?",
            "date_published": "2021-05-01 00:00:00 +0000"
            
        },

        {
            "id": "/blog/take-the-easy-way-out",
            "title": "Take the Easy Way Out",
            "content_html": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p>Or, another way, take the simplest way forward.</p>\n\n<hr>\n\n<p>The first time I started writing online I spent weeks researching tools. Eventually I picked one that fit all my possible eventual needs, but required extensive customization. After all this work I was so exhausted that I gave up.</p>\n\n<p>The second time I started writing online I decided I wouldn’t make the same mistake, instead I would just write the entire thing from scratch. You can imagine how this ended up. (Note: I did end up publishing my site online, and I’m still very proud of that work, however, it did not get me into the habit of publishing often.)</p>\n\n<p>The third time I started writing, and hopefully the last, I went with a pre-existing platform because I knew it would be good enough to start doing the <em>real work</em>—that is, to start publishing often.</p>\n\n<p>All this to say I, like many, have a bad habit of the <em>depth first search.</em> Before we can feel comfortable taking the first step, we need to be certain that it’ll be the first step of the optimal approach.</p>\n\n<p>This is not only ridiculous, it gets in your way.</p>\n\n<p>I’ve had to learn this lesson over and over, but each time it gets a little easier and I catch myself a little quicker. Now when starting a project I try to ask myself “What is the <em>true purpose?</em> What am I trying to develop?”</p>\n\n<p>Now, if your purpose is to learn about html, css, seo, open graph markup, etc. Then writing something from scratch might be the right approach. But, if your purpose is to <strong>publish writing online</strong> then all of that additional work only serves to distract.</p>\n\n<p>In this specific case the easy way out—going with a system I don’t need to think about—is what empowers me to do the real work.</p>\n\n<p>The advice I would give myself:</p>\n\n<ul>\n  <li>Start now</li>\n  <li>Start simply</li>\n  <li>Focus on the meaningful work</li>\n  <li>Ignore everything else</li>\n</ul>\n\n<p>Or, otherwise put, “take the easy way out.”</p>\n</body></html>\n",
            "url": "https://www.connorjrobbins.com/blog/take-the-easy-way-out",
            "summary": "Or, another way, take the simplest way forward.",
            "date_published": "2021-04-24 00:00:00 +0000"
            
        }

    ]
}
